[
  {
    "source": "Yahoo Finance",
    "title": "Gold Slips as Traders Book Profits After Mild US Inflation Data",
    "summary": "Bullion fell as much as 1.1%, having climbed 2.4% on Friday, when a modest rise in the US consumer price index for January allayed concerns about a bigger jump and boosted the case for the Federal Reserve to trim interest rates.  Lower borrowing costs typically benefit non-yielding precious metals.  Demand for precious metals in the country has been frenetic in recent months, prompting authorities in the retail hub of Shenzhen to issue a stark warning against “illegal gold-trading activities,” ranging from apps offering leverage to retail investors to online live streams promoting bullion sales.",
    "link": "https://finance.yahoo.com/news/gold-edges-lower-traders-lock-234644501.html?.tsrc=rss"
  },
  {
    "source": "Yahoo Finance",
    "title": "Dow Jones Futures Rise; Apple, Google, Amazon, Meta, Nvidia In Focus",
    "summary": "Here are ways to reduce the risks of a highly dangerous market. Apple, Google, Amazon, Meta and Nvidia are masking some underlying strength",
    "link": "https://finance.yahoo.com/m/5a940658-9875-3edf-9d6a-97242b856cd9/dow-jones-futures-rise%3B.html?.tsrc=rss"
  },
  {
    "source": "Yahoo Finance",
    "title": "4 Hypergrowth Tech Investments to Buy in 2026 -- Including, of Course, Nvidia",
    "summary": "These investments have done well in the past, and the future looks bright.",
    "link": "https://www.fool.com/investing/2026/02/15/4-hypergrowth-tech-investments-to-buy-in-2026-incl/?.tsrc=rss"
  },
  {
    "source": "Yahoo Finance",
    "title": "Odessa appoints Parsons, Naylor and Brooks to drive exploration and M&A strategy",
    "summary": "Odessa Minerals Ltd (ASX:ODE) has appointed experienced resources executives Steve Parsons and Michael Naylor as consultants, alongside extending the consulting agreement of geologist Sam Brooks as chief technical consultant. The appointments are designed to strengthen Odessa's exploration...",
    "link": "https://www.proactiveinvestors.com/companies/news/1087391/odessa-appoints-parsons-naylor-and-brooks-to-drive-exploration-and-m-a-strategy-1087391.html?.tsrc=rss"
  },
  {
    "source": "Yahoo Finance",
    "title": "Why Kyndryl Stock Crashed This Week",
    "summary": "Kyndryl's recent quarterly report arrived with some terrible news for investors.",
    "link": "https://www.fool.com/investing/2026/02/15/why-cohu-stock-is-sinking-today/?.tsrc=rss"
  },
  {
    "source": "Yahoo Finance",
    "title": "Here's How Main Street Capital Beats The Market From Here",
    "summary": "Main Street Capital has delivered market-beating total returns since its IPO.",
    "link": "https://www.fool.com/investing/2026/02/15/heres-how-main-street-capital-beats-the-market-fro/?.tsrc=rss"
  },
  {
    "source": "Yahoo Finance",
    "title": "Apple Stock Is Interesting, but Here's What I'd Buy Instead",
    "summary": "Apple stock has posted respectable gains on the market over the past six months, but its supplier partner has been a better investment.",
    "link": "https://www.fool.com/investing/2026/02/15/apple-stock-is-interesting-but-heres-what-id-buy-i/?.tsrc=rss"
  },
  {
    "source": "Yahoo Finance",
    "title": "Ashapuri Gold Ornament Ltd (BOM:542579) Q3 2026 Earnings Call Highlights: Strong Profit Growth ...",
    "summary": "Despite challenges from rising gold prices, Ashapuri Gold Ornament Ltd (BOM:542579) reports robust earnings growth and strategic expansion plans.",
    "link": "https://finance.yahoo.com/news/ashapuri-gold-ornament-ltd-bom-010153522.html?.tsrc=rss"
  },
  {
    "source": "Yahoo Finance",
    "title": "Will the Stock Market Crash in 2026? Billionaire Ray Dalio Just Gave a Clear Warning to Investors.",
    "summary": "Ray Dalio just warned of a coming \"capital war,\" and it could spell trouble for the debt-fueled AI boom.",
    "link": "https://www.fool.com/investing/2026/02/15/stock-market-crash-in-2026-billionaire-ray-dalio/?.tsrc=rss"
  },
  {
    "source": "Yahoo Finance",
    "title": "Gold Falls on Possible Position Adjustments",
    "summary": "PRECIOUS METALS 2340 GMT — Gold falls in the morning Asian session on possible position adjustments. However, losses could be limited by Friday’s softer-than-expected U.S. CPI data. The data have led markets to price in a more aggressive rate-cutting cycle from the Fed, Sucden Financial’s Research team says in commentary.",
    "link": "https://finance.yahoo.com/m/d982e7e4-62a8-3d59-a819-ecba86cfb8b4/gold-falls-on-possible.html?.tsrc=rss"
  },
  {
    "source": "Yahoo Finance",
    "title": "Riversgold finalises Hawkstone drilling program at Tambourah ahead of early March start",
    "summary": "Riversgold Ltd (ASX:RGL, FRA:RGV, OTC:RVSGF) has finalised planning for an exploration drilling program at the Hawkstone Prospect within its 100%-owned Tambourah Project in Western Australia, with execution expected to begin in early March. The upcoming campaign will represent the first...",
    "link": "https://www.proactiveinvestors.com/companies/news/1087387/riversgold-finalises-hawkstone-drilling-program-at-tambourah-ahead-of-early-march-start-1087387.html?.tsrc=rss"
  },
  {
    "source": "Yahoo Finance",
    "title": "Tom Lee Says AI Killed Software And Job Losses Are 'Soon To Follow'",
    "summary": "Fundstrat’s Tom Lee warned AI is destroying the $450 billion software sector and job losses will follow, predicting a dovish Fed under Kevin Warsh will cut rates as core CPI is forecasted to drop in Friday’s data release. The AI Job Destruction Warning Lee told CNBC on Thursday that AI is “wreaking havoc across software” and job losses are “soon to follow.” Software companies, which once “ate the world,” now face existential threat from AI displacement. “If software shrinks, that’s deflation,” L",
    "link": "https://finance.yahoo.com/news/tom-lee-says-ai-killed-230155251.html?.tsrc=rss"
  },
  {
    "source": "Yahoo Finance",
    "title": "Harvard University's Investment Manager Loads Up On 3.87M ETHA Shares",
    "summary": "Harvard University is known for its strong academia, so is its asset manager's recent investment in a crypto ETF a smart move?",
    "link": "https://www.fool.com/coverage/filings/2026/02/15/harvard-university-s-asset-manager-loads-up-on-3-87m-etha-shares/?.tsrc=rss"
  },
  {
    "source": "Yahoo Finance",
    "title": "XLP vs. FTXG: The Clash of Consumer Staple ETFs",
    "summary": "These two consumer staple ETFs will provide exposure to product manufacturers you've grown up knowing.",
    "link": "https://www.fool.com/coverage/etfs/2026/02/15/xlp-vs-ftxg-the-clash-of-consumer-staple-etfs/?.tsrc=rss"
  },
  {
    "source": "Yahoo Finance",
    "title": "The 1 Stock I'd Buy Before SPDR Gold Shares Right Now",
    "summary": "The SPDR Gold Trust has enjoyed a strong run, but silver has more going for it due to its industrial applications.",
    "link": "https://www.fool.com/investing/2026/02/15/the-1-stock-id-buy-before-spdr-gold-shares-right-n/?.tsrc=rss"
  },
  {
    "source": "Yahoo Finance",
    "title": "Hungry to Grow Your Portfolio? These Food & Beverage ETFs May Help",
    "summary": "We rely on food and beverages to fuel us, and these two food and beverages ETFs may help fuel your portfolio.",
    "link": "https://www.fool.com/coverage/etfs/2026/02/15/hungry-to-grow-your-portfolio-these-food-and-beverage-etfs-may-help/?.tsrc=rss"
  },
  {
    "source": "Yahoo Finance",
    "title": "Assessing Sprott (TSX:SII) Valuation After Strong Share Price Momentum",
    "summary": "Why Sprott Is On Investors’ Radar Sprott (TSX:SII) has caught investor attention after a notable rise in its share price, with the stock delivering positive returns over the past month, the past three months, and over the last year. See our latest analysis for Sprott. The recent 4.3% 1 day share price return and 39.9% 90 day share price return at around CA$168.07 sit alongside a very large 1 year total shareholder return of 182.2%, which points to strong momentum over both shorter and longer...",
    "link": "https://finance.yahoo.com/news/assessing-sprott-tsx-sii-valuation-211031245.html?.tsrc=rss"
  },
  {
    "source": "Yahoo Finance",
    "title": "BC-Nikkei 225 Futures",
    "summary": "Prices as of 4:00:00 PM Sunday, February 15. Nikkei 225 (Yen) (CME)",
    "link": "https://finance.yahoo.com/news/bc-nikkei-225-futures-210016841.html?.tsrc=rss"
  },
  {
    "source": "Yahoo Finance",
    "title": "Is Compass Stock a Buy After Barrier Capital Initiated a Position Worth Over $10 Million?",
    "summary": "Compass delivers cloud-based tools for real estate agents, integrating CRM, marketing, and operations on a unified digital platform.",
    "link": "https://www.fool.com/coverage/filings/2026/02/15/is-compass-stock-a-buy-after-barrier-capital-initiated-a-position-worth-over-usd10-million/?.tsrc=rss"
  },
  {
    "source": "Yahoo Finance",
    "title": "CoreWeave Jumps 7% This Week Ahead of February 26 Earnings",
    "summary": "CoreWeave (NASDAQ:CRWV) gained 6.77% this week, closing at $96.04 on February 13. That performance stands in sharp contrast to the S&amp;P 500 (NYSEARCA:SPY), which dropped 1.29% over the same period. Year to date, CoreWeave has surged 34.12%, climbing from $71.61 to current levels, while the broader market has remained essentially flat. Three distinct storylines explain ... CoreWeave Jumps 7% This Week Ahead of February 26 Earnings",
    "link": "https://247wallst.com/investing/2026/02/15/coreweave-jumps-7-this-week-ahead-of-february-26-earnings/?.tsrc=rss"
  },
  {
    "source": "CNBC News",
    "title": "In bitcoin price plummet, ETF flows are down but aren't signaling 'crypto winter' investor panic",
    "summary": "As the price of bitcoin and other cryptocurrencies has crashed, exchange-traded funds have seen outflows, but ETF selling doesn't look like investor panic.",
    "link": "https://www.cnbc.com/2026/02/15/bitcoin-price-crash-crypto-winter-investors-etf-flows.html"
  },
  {
    "source": "CNBC News",
    "title": "AI disruption could spark a ‘shock to the system’ in credit markets, UBS analyst says",
    "summary": "UBS analyst Matthew Mish told CNBC that the artificial intelligence transformation is happening faster than he and his colleagues had previously anticipated.",
    "link": "https://www.cnbc.com/2026/02/13/ai-credit-markets.html"
  },
  {
    "source": "CNBC News",
    "title": "Stocks making the biggest moves premarket: DraftKings, Applied Materials, Roku, Rivian Automotive and more",
    "summary": "These are the stocks posting the largest moves in premarket trading.",
    "link": "https://www.cnbc.com/2026/02/13/stocks-making-the-biggest-moves-premarket-draftkings-applied-materials-roku-rivian-automotive-and-more.html"
  },
  {
    "source": "CNBC News",
    "title": "China's Baidu adds OpenClaw AI into search app for 700 million users ahead of Lunar New Year",
    "summary": "Chinese search engine operator Baidu plans Friday to start letting smartphone app users to directly tell OpenClaw AI to perform tasks.",
    "link": "https://www.cnbc.com/2026/02/13/baidu-openclaw-ai-search-app-integration-china-lunar-new-year.html"
  },
  {
    "source": "CNBC News",
    "title": "Xiaomi's electric SUV tops China sales in January, sells twice as many as Tesla's Model Y",
    "summary": "Chinese smartphone company Xiaomi has priced its vehicles below Tesla's and marketed features it claims are comparable or superior.",
    "link": "https://www.cnbc.com/2026/02/13/xiaomis-electric-suv-tops-china-sales-in-january-sells-twice-as-many-as-teslas-model-y.html"
  },
  {
    "source": "CNBC News",
    "title": "Stocks making the biggest moves after hours: Rivian, Applied Materials, Airbnb, Pinterest, DraftKings & more",
    "summary": "These are the stocks posting the largest moves in extended trading.",
    "link": "https://www.cnbc.com/2026/02/12/stocks-making-the-biggest-moves-after-hours-amat-abnb-pins-dkng.html"
  },
  {
    "source": "CNBC News",
    "title": "Stocks making the biggest moves midday: Crocs, Cisco, Lululemon, AppLovin & more",
    "summary": "These are the stocks posting the largest moves in midday trading.",
    "link": "https://www.cnbc.com/2026/02/12/stocks-making-the-biggest-moves-midday-crox-csco-lulu-app.html"
  },
  {
    "source": "CNBC News",
    "title": "Tech IPO hype gets drowned out on Wall Street by prospect of $1 trillion in debt sales",
    "summary": "SpaceX's potential IPO has generated plenty of investor buzz, but all of the real action in tech capital markets is currently on the debt side.",
    "link": "https://www.cnbc.com/2026/02/12/tech-ipo-hype-drowned-out-by-prospect-of-1-trillion-in-debt-sales.html"
  },
  {
    "source": "CNBC News",
    "title": "Stocks making the biggest moves premarket: Cisco, QuantumScape, Rollins, Fastly and more",
    "summary": "These are the stocks posting the largest moves in the premarket.",
    "link": "https://www.cnbc.com/2026/02/12/stocks-making-the-biggest-moves-premarket-.html"
  },
  {
    "source": "CNBC News",
    "title": "Stocks making the biggest moves after hours: Cisco Systems, McDonald's, AppLovin and more",
    "summary": "These are the stocks posting the largest moves in extended trading.",
    "link": "https://www.cnbc.com/2026/02/11/stocks-making-the-biggest-moves-after-hours-csco-mcd-app.html"
  },
  {
    "source": "CNBC News",
    "title": "David Einhorn says the Fed will cut 'substantially more' than two times. So he's betting big on gold",
    "summary": "Greenlight Capital's David Einhorn anticipates the Federal Reserve will issue more interest rate cuts than what's being anticipated.",
    "link": "https://www.cnbc.com/2026/02/11/david-einhorn-says-the-fed-will-cut-substantially-more-than-two-times-so-hes-betting-big-on-gold.html"
  },
  {
    "source": "CNBC News",
    "title": "Stocks making the biggest moves midday: Acadia Healthcare, Vertiv, Moderna, Unity Software, Generac & more",
    "summary": "These are the stocks posting the largest moves in midday trading.",
    "link": "https://www.cnbc.com/2026/02/11/stocks-making-the-biggest-moves-midday-achc-vrt-mrna-u-gnrc.html"
  },
  {
    "source": "CNBC News",
    "title": "Stocks making the biggest moves premarket: Lyft, Moderna, Cloudflare, Ford, Zillow Group and more",
    "summary": "These are the stocks posting the largest moves in early trading.",
    "link": "https://www.cnbc.com/2026/02/11/stocks-making-the-biggest-moves-premarket-lyft-mrna-net-f-zg.html"
  },
  {
    "source": "CNBC News",
    "title": "Crypto's 'age of speculation' may be over, says Galaxy CEO Mike Novogratz",
    "summary": "The decline in bitcoin, other cryptocurrencies in 2026 is not just another dip but may mark end of retail speculation trading, says Galaxy CEO Mike Novogratz.",
    "link": "https://www.cnbc.com/2026/02/10/bitcoin-crypto-trading-speculation-galaxy-ceo-mike-novogratz.html"
  },
  {
    "source": "CNBC News",
    "title": "Vatican Bank makes first foray into equity indexes, setting stage for potential ETF launches",
    "summary": "The Holy See-linked bank debuted two indexes tracking 50 stocks that it said align with Catholic teachings, marking a push into retail investment products.",
    "link": "https://www.cnbc.com/2026/02/10/vatican-bank-makes-first-foray-into-equity-indexes-setting-stage-for-potential-etf-launches.html"
  },
  {
    "source": "CNBC News",
    "title": "Bitcoin plunge: Bitwise CIO cites 'the four-year cycle' as No. 1 reason for losses",
    "summary": "Bitwise Asset Management CIO Matt Hougan delivers his take on the cryptocurrency sell-off.",
    "link": "https://www.cnbc.com/2026/02/10/bitcoin-crash-bitwise-cio-cites-the-four-year-cycle-for-losses.html"
  },
  {
    "source": "CNBC News",
    "title": "Alphabet boosts debt sale again as total raise exceeds $30 billion, sources say",
    "summary": "Alphabet again boosted the size of its bond sale as the internet giant prepares to accelerate its AI buildout.",
    "link": "https://www.cnbc.com/2026/02/10/alphabet-set-to-raise-over-30-billion-in-global-debt-sale-sources.html"
  },
  {
    "source": "CNBC News",
    "title": "Stocks making the biggest moves midday: Ferrari, Incyte, S&P Global, Datadog, BP and more",
    "summary": "These are some of the stocks posting the largest midday moves.",
    "link": "https://www.cnbc.com/2026/02/10/stocks-making-biggest-midday-moves-race-incy-spgi-ddog-bp.html"
  },
  {
    "source": "CNBC News",
    "title": "Michael Saylor downplays Strategy credit risk as bitcoin tumbles: 'We'll refinance the debt'",
    "summary": "Strategy plans to continue refinancing its debt and buying bitcoin, even as the token tumbles, CEO Michael Saylor said Tuesday on CNBC's \"Squawk Box.\"",
    "link": "https://www.cnbc.com/2026/02/10/michael-saylor-downplays-strategy-credit-risk-as-bitcoin-tumbles-well-refinance-the-debt.html"
  },
  {
    "source": "CNBC News",
    "title": "Stocks making the biggest moves premarket: Coca-Cola, CVS Health, Ferrari, Taiwan Semi and more",
    "summary": "These are the stocks posting the largest moves in premarket trading.",
    "link": "https://www.cnbc.com/2026/02/10/stocks-making-the-biggest-moves-premarket-coca-cola-cvs-health-ferrari-taiwan-semi-and-more.html"
  },
  {
    "source": "Financial Times World News",
    "title": "Russia’s Wagner Group pivots to European sabotage, say western officials",
    "summary": "Recruiters involved with fighter group are said to be targeting agents for operations on Nato soil",
    "link": "https://www.ft.com/content/dbd1d803-ab37-43f1-920f-fce74952313a"
  },
  {
    "source": "Financial Times World News",
    "title": "‘The best we can hope for’: Rubio’s Munich unity appeal fails to woo Europe",
    "summary": "US secretary of state sought to mollify but underlying message reinforced US administration’s talking points",
    "link": "https://www.ft.com/content/94633f65-04c0-4cea-b682-98c17720eebc"
  },
  {
    "source": "Financial Times World News",
    "title": "The AI productivity take-off is finally visible",
    "summary": "New economic data suggests the US is transitioning to a phase of measurable gains from the technology",
    "link": "https://www.ft.com/content/4b51d0b4-bbfe-4f05-b50a-1d485d419dc5"
  },
  {
    "source": "Financial Times World News",
    "title": "Yes, we should preserve western culture but not like this . . .",
    "summary": "The idea that we must rely on the likes of Elon Musk, Donald Trump and Kid Rock as custodians is laughable",
    "link": "https://www.ft.com/content/9fbc4ae4-c279-44fa-9d59-d49bc970c4ac"
  },
  {
    "source": "Financial Times World News",
    "title": "UK to tighten online safety laws to include AI chatbots",
    "summary": "Keir Starmer to warn tech companies that ‘no platform gets a free pass’ after deepfake scandal involving Grok",
    "link": "https://www.ft.com/content/15917aa4-2d40-49be-85c3-da395b16e7f1"
  },
  {
    "source": "Financial Times World News",
    "title": "OpenAI hires OpenClaw founder Peter Steinberger",
    "summary": "The viral open source project enables users to create personal AI agents",
    "link": "https://www.ft.com/content/45b172e6-df8c-41a7-bba9-3e21e361d3aa"
  },
  {
    "source": "Financial Times World News",
    "title": "End of EV euphoria triggers $65bn hit for carmakers",
    "summary": "Manufacturers rethink US strategy in pivot back to petrol and hybrids",
    "link": "https://www.ft.com/content/2daa41c3-3721-46d1-8954-7c43d5149995"
  },
  {
    "source": "Financial Times World News",
    "title": "Ottawa’s shift away from US defence   manufacturers aims to create 125,000 jobs",
    "summary": "‘Buy Canadian’ strategy will raise military spending to 5 per cent of GDP and boost economy, new plan says",
    "link": "https://www.ft.com/content/cde7c236-e62f-4ced-9667-7115f16a40e6"
  },
  {
    "source": "Financial Times World News",
    "title": "Franc’s relentless rise alarms Swiss companies",
    "summary": "Safe haven currency’s bull run triggers fears about impact on sales and profits",
    "link": "https://www.ft.com/content/3fc82496-1132-4cb3-a967-25c4c274fbea"
  },
  {
    "source": "Google News - Stock Market",
    "title": "S&P 500 closes little changed after soft inflation report, index notches losing week: Live updates - CNBC",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMid0FVX3lxTE1rMzAwSXVIelF1VVJ2WU1YbzFiLWtfa0xMRDFVLTZpVE1WcGlrM3hPZnJScFV1b1A2WTNXX3JQeHFEcWRaTU5HdDlYMF83czJndGZqZUY0Y3piUTkzME5LaWFoVlFQQ0xCSXAyaGtlNUlMMU1JMTBJ0gF8QVVfeXFMUG1WcWJDeUpjZVd1ZDdzSWxFaEQ1VUlWX0NnWnFBZTQ1dFBmVlF1dWY1TzRjS2hUbjItWGxzWjFjczZ4QnU4RWVsQ2thWFMyZ0I4T2lfM0p0U3VaUFc4S0t5RXZVTTUyQS1sMzBQYWhOWlhWZ0lncmpnczY1Mw?oc=5\" target=\"_blank\">S&amp;P 500 closes little changed after soft inflation report, index notches losing week: Live updates</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CNBC</font>",
    "link": "https://news.google.com/rss/articles/CBMid0FVX3lxTE1rMzAwSXVIelF1VVJ2WU1YbzFiLWtfa0xMRDFVLTZpVE1WcGlrM3hPZnJScFV1b1A2WTNXX3JQeHFEcWRaTU5HdDlYMF83czJndGZqZUY0Y3piUTkzME5LaWFoVlFQQ0xCSXAyaGtlNUlMMU1JMTBJ0gF8QVVfeXFMUG1WcWJDeUpjZVd1ZDdzSWxFaEQ1VUlWX0NnWnFBZTQ1dFBmVlF1dWY1TzRjS2hUbjItWGxzWjFjczZ4QnU4RWVsQ2thWFMyZ0I4T2lfM0p0U3VaUFc4S0t5RXZVTTUyQS1sMzBQYWhOWlhWZ0lncmpnczY1Mw?oc=5"
  },
  {
    "source": "Google News - Stock Market",
    "title": "A Stock Market Doom Loop Is Hitting Everything That Touches AI - Bloomberg.com",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMiswFBVV95cUxPcW9VVS1JV29FazRmcHFhdFJJWU92eE5RQmJ5YjRhQVB5bE5NTS1ZSGxWWVdreUZLaFI5bHNYNlNGMkRBZXJFS0tfZFA3c1ZvaTB2bnp1TE9vWC0xdFNpd0hOUnJURGtxMEd3eTNrSkhhRGZWMThMYlpEc2FwOVBqWk5KMEsyZC15WFY2TmJDUkMyMkRWZkd0Y3hhYmFlalhyMzA1Q25FSG52LUcxN082QnU5cw?oc=5\" target=\"_blank\">A Stock Market Doom Loop Is Hitting Everything That Touches AI</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Bloomberg.com</font>",
    "link": "https://news.google.com/rss/articles/CBMiswFBVV95cUxPcW9VVS1JV29FazRmcHFhdFJJWU92eE5RQmJ5YjRhQVB5bE5NTS1ZSGxWWVdreUZLaFI5bHNYNlNGMkRBZXJFS0tfZFA3c1ZvaTB2bnp1TE9vWC0xdFNpd0hOUnJURGtxMEd3eTNrSkhhRGZWMThMYlpEc2FwOVBqWk5KMEsyZC15WFY2TmJDUkMyMkRWZkd0Y3hhYmFlalhyMzA1Q25FSG52LUcxN082QnU5cw?oc=5"
  },
  {
    "source": "Google News - Stock Market",
    "title": "ASX Penny Stocks With Market Caps Over A$700M To Consider - Yahoo Finance UK",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMigwFBVV95cUxPYWxuWl8zX3BvY1dZSDZuOHpKSldweDgxTG4tTk12dTdXeHRBMDloc3BMMzNjUXN1MUVxUVFlMnEtb1RIcnk4cDZ1d3NzQWRVeXBVY1NHc19xTFNVczI3SlUtSjJGOTFlTWpCeFZJM0MzLXN2Q3ZrX3RNbGVSaml2ZXlUWQ?oc=5\" target=\"_blank\">ASX Penny Stocks With Market Caps Over A$700M To Consider</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Yahoo Finance UK</font>",
    "link": "https://news.google.com/rss/articles/CBMigwFBVV95cUxPYWxuWl8zX3BvY1dZSDZuOHpKSldweDgxTG4tTk12dTdXeHRBMDloc3BMMzNjUXN1MUVxUVFlMnEtb1RIcnk4cDZ1d3NzQWRVeXBVY1NHc19xTFNVczI3SlUtSjJGOTFlTWpCeFZJM0MzLXN2Q3ZrX3RNbGVSaml2ZXlUWQ?oc=5"
  },
  {
    "source": "Google News - Stock Market",
    "title": "Asia stocks muted in holiday-thinned trade, Japan dips on dismal GDP - Investing.com",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMiwAFBVV95cUxORFF1Q2Q2SHp1Yy03V3d5U3VtVmFsSjYyay05UG1ENTBnUFU2akRfdncxYzJHTEtDSElOemdhalNYWlN0YTliNDlZVnIxc2h4UFJvdHJ3djhQOTZEN2l6cXVydkY5WFNzc0trWjUwMjlISUxJazRPUDFHT2RGWWswQ0FXVjZhQXJabG5ZZEdvXzBBRWVLcUFMbEIzVnlOMDRvWF9BaE1SVVYwb29jZmVQMGxnUEtkUHlxS1Vac3VKeWw?oc=5\" target=\"_blank\">Asia stocks muted in holiday-thinned trade, Japan dips on dismal GDP</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Investing.com</font>",
    "link": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxORFF1Q2Q2SHp1Yy03V3d5U3VtVmFsSjYyay05UG1ENTBnUFU2akRfdncxYzJHTEtDSElOemdhalNYWlN0YTliNDlZVnIxc2h4UFJvdHJ3djhQOTZEN2l6cXVydkY5WFNzc0trWjUwMjlISUxJazRPUDFHT2RGWWswQ0FXVjZhQXJabG5ZZEdvXzBBRWVLcUFMbEIzVnlOMDRvWF9BaE1SVVYwb29jZmVQMGxnUEtkUHlxS1Vac3VKeWw?oc=5"
  },
  {
    "source": "Google News - Stock Market",
    "title": "Here are 7 charts guaranteed to stress you out about the stock market - MarketWatch",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMitwNBVV95cUxObEJLNC1jWDA0dEZHMzdLdjJlMWFUcGEtWnBVdUFLczlZN0hEbVdwcWM4aU5ldk9qN0h6VGRqZmJsZTI5NWU3YlJibWJYMXFEVVVXZEhQNmF4Z29pa0NyTmdtOHZ5cHlYVzZaMjJiaGpXU3RpOGJsdi0yc3NtcUVzMnZHbERyQ3lsa0V6NnM2WFZaNTdWZ1ZfQTVDbFF4WnZ0RkVSYXp6eFllbVBCOTE1UXVZUW9YcFE5Z2N1VmcweTFfZXJxSzJPQWxsWnFLTjY5eUFkZzhoZFFDWWlMbG9zZzUydWUxbXlodFBPRDBKb3p0al93ZWE5dllmSjFHMkFxdGh6QmxibFNNYXQyLUtLU0ltV2s4R2hoanhpTHVxWTNSd0NBbkJNdnVQNUN4bjBqX2dmY25IR1pLanJlNWJzUTUtbThPb2ZVWllKMEkzLXI4Tmg1dHV5ejc5ektUb3Mtc2w4dlhXeGRTWEE5S2o4czFGUW03NHNpUkFZTFNWQWtONHFobGZPTEFGbzJwdkZIanFXWHdFZDJZcDNVa2NXTHQwY2MwNHFPXzl1VU1fQ21sSzFzSFZJ?oc=5\" target=\"_blank\">Here are 7 charts guaranteed to stress you out about the stock market</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">MarketWatch</font>",
    "link": "https://news.google.com/rss/articles/CBMitwNBVV95cUxObEJLNC1jWDA0dEZHMzdLdjJlMWFUcGEtWnBVdUFLczlZN0hEbVdwcWM4aU5ldk9qN0h6VGRqZmJsZTI5NWU3YlJibWJYMXFEVVVXZEhQNmF4Z29pa0NyTmdtOHZ5cHlYVzZaMjJiaGpXU3RpOGJsdi0yc3NtcUVzMnZHbERyQ3lsa0V6NnM2WFZaNTdWZ1ZfQTVDbFF4WnZ0RkVSYXp6eFllbVBCOTE1UXVZUW9YcFE5Z2N1VmcweTFfZXJxSzJPQWxsWnFLTjY5eUFkZzhoZFFDWWlMbG9zZzUydWUxbXlodFBPRDBKb3p0al93ZWE5dllmSjFHMkFxdGh6QmxibFNNYXQyLUtLU0ltV2s4R2hoanhpTHVxWTNSd0NBbkJNdnVQNUN4bjBqX2dmY25IR1pLanJlNWJzUTUtbThPb2ZVWllKMEkzLXI4Tmg1dHV5ejc5ektUb3Mtc2w4dlhXeGRTWEE5S2o4czFGUW03NHNpUkFZTFNWQWtONHFobGZPTEFGbzJwdkZIanFXWHdFZDJZcDNVa2NXTHQwY2MwNHFPXzl1VU1fQ21sSzFzSFZJ?oc=5"
  },
  {
    "source": "Google News - Stock Market",
    "title": "Futures Rise; What To Do Now - Investor's Business Daily",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMi0AFBVV95cUxPUVBpX18tdkg0dVlvVHJFZmxGZjBYT2h4MnhnX0pQalMwR01lTXlDdWJCNWFESmtWaTZUUExFb0l5Njl5dG94MXJBWDRWYURlQTJDTlFmV3hEcjU3NlQxVHlWbkJDaWM0bzBNYzJMQWZOaGpVQURQaDBmN2NUdU9OYnhPSmxnUC1LdGFPSS1VbVNMcWVhOGhVQ3hmNnB1dHBSb2RpVG9pR1p6VFMyNDdRZEVpTkhjdlVrekdZTmtYbnFWNTVTYjhLZ3BjTTlSMDQ2?oc=5\" target=\"_blank\">Futures Rise; What To Do Now</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Investor's Business Daily</font>",
    "link": "https://news.google.com/rss/articles/CBMi0AFBVV95cUxPUVBpX18tdkg0dVlvVHJFZmxGZjBYT2h4MnhnX0pQalMwR01lTXlDdWJCNWFESmtWaTZUUExFb0l5Njl5dG94MXJBWDRWYURlQTJDTlFmV3hEcjU3NlQxVHlWbkJDaWM0bzBNYzJMQWZOaGpVQURQaDBmN2NUdU9OYnhPSmxnUC1LdGFPSS1VbVNMcWVhOGhVQ3hmNnB1dHBSb2RpVG9pR1p6VFMyNDdRZEVpTkhjdlVrekdZTmtYbnFWNTVTYjhLZ3BjTTlSMDQ2?oc=5"
  },
  {
    "source": "Google News - Stock Market",
    "title": "Is the stock market open on Presidents Day? See 2026 holiday schedule. - USA Today",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMioAFBVV95cUxNSGp4ajJmRFQ2VDE0VGpiTzV5bmo0YWFhaUhxVGYtVzczbUZOelNicm13M3duZ1dDampLOXlLNnQ4aThrbzIwRmdrOXZZZ0RvV1hvNGRPUUx1U2lEUEc3UWZpbzMyT3hUYVJaR0U1ZG84X1V1OFhYYm1Iby1YYTV5dTEwbzVBbUpIUjRZbXZaZThxaHB0c2ctekRWZUtJX01V?oc=5\" target=\"_blank\">Is the stock market open on Presidents Day? See 2026 holiday schedule.</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">USA Today</font>",
    "link": "https://news.google.com/rss/articles/CBMioAFBVV95cUxNSGp4ajJmRFQ2VDE0VGpiTzV5bmo0YWFhaUhxVGYtVzczbUZOelNicm13M3duZ1dDampLOXlLNnQ4aThrbzIwRmdrOXZZZ0RvV1hvNGRPUUx1U2lEUEc3UWZpbzMyT3hUYVJaR0U1ZG84X1V1OFhYYm1Iby1YYTV5dTEwbzVBbUpIUjRZbXZaZThxaHB0c2ctekRWZUtJX01V?oc=5"
  },
  {
    "source": "Google News - Stock Market",
    "title": "The Stock Market and Bond Market Flash Warnings Not Seen in Decades. History Says the S&P 500 Will Do This Next. - The Motley Fool",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMilwFBVV95cUxQU3oxRnk3SFpXOEZNY21pMDBPb21ra1JGZEJlVDctRzhYTTBFRTdObkRzRGc5UVJhVjJHNEpxOHlxdF9tdXBnd1l2MzI4bEtnbW9wc3Nfd2JUNlRlQzRfeFNqb0s3c1NENkhsMGh1VUt4QnBoeHJrc0tGV2FrbGI4NjBtSk1lMHlQdU5VN0w2azY4THZpUEJr?oc=5\" target=\"_blank\">The Stock Market and Bond Market Flash Warnings Not Seen in Decades. History Says the S&amp;P 500 Will Do This Next.</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Motley Fool</font>",
    "link": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQU3oxRnk3SFpXOEZNY21pMDBPb21ra1JGZEJlVDctRzhYTTBFRTdObkRzRGc5UVJhVjJHNEpxOHlxdF9tdXBnd1l2MzI4bEtnbW9wc3Nfd2JUNlRlQzRfeFNqb0s3c1NENkhsMGh1VUt4QnBoeHJrc0tGV2FrbGI4NjBtSk1lMHlQdU5VN0w2azY4THZpUEJr?oc=5"
  },
  {
    "source": "Google News - Stock Market",
    "title": "The great software stock meltdown - Financial Times",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMicEFVX3lxTFBFUS04XzB4TEV4eTR6T1BXWjBVb3BaMFFxeF9zV1hwbzdfa1VEWnppYTYzQTY0OHUtOVhvSVdhZGh5cXA1aWJ3cm95R3RzQjBOOHVaODdoX29LT3lfWGxBWHptcmhraE9BN2x4cEVHWUc?oc=5\" target=\"_blank\">The great software stock meltdown</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Financial Times</font>",
    "link": "https://news.google.com/rss/articles/CBMicEFVX3lxTFBFUS04XzB4TEV4eTR6T1BXWjBVb3BaMFFxeF9zV1hwbzdfa1VEWnppYTYzQTY0OHUtOVhvSVdhZGh5cXA1aWJ3cm95R3RzQjBOOHVaODdoX29LT3lfWGxBWHptcmhraE9BN2x4cEVHWUc?oc=5"
  },
  {
    "source": "Google News - Stock Market",
    "title": "The stock market is reflecting fears of an AI apocalypse for white-collar jobs - MSN",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMiXEFVX3lxTE9yeTBnRkluQ0h5N2FaVGNBdXF3VGJyNXp3RU8tTHd6MnJxNldhaWVMNk9DMnlDZDE2U2dxeFdBTUhKLVlOZDZQb256ZHRJUVcxa0d0anUzQVFISmFm?oc=5\" target=\"_blank\">The stock market is reflecting fears of an AI apocalypse for white-collar jobs</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">MSN</font>",
    "link": "https://news.google.com/rss/articles/CBMiXEFVX3lxTE9yeTBnRkluQ0h5N2FaVGNBdXF3VGJyNXp3RU8tTHd6MnJxNldhaWVMNk9DMnlDZDE2U2dxeFdBTUhKLVlOZDZQb256ZHRJUVcxa0d0anUzQVFISmFm?oc=5"
  },
  {
    "source": "Google News - Stock Market",
    "title": "'The dark side of AI': Wall Street weighs recent stock sell-off over disruption fears - Yahoo Finance",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMixwFBVV95cUxNalpQSGdsVlpfUHJQTTFEM2hWREpReS1VTmpseFdhQzFxQ18yVmVGb1lXR3QxUlhDNFoyY3pIMW9jcVZURkY0Z3hma1JUWklVSzhXdU1VcjIteUdWaERGQlFSOGJuU0I0cjJHQkpwelNqal9jaC1tdmEtLW5pUmt3WmxEUjZpS1V0UDJFaWp5MklBcGRXLVQ0LXBaclBMV3Z1YjNPN3hHUW5wcktMSmQyUzl3aThaWFpGN3AtZlpiWTRGV3REOXI4?oc=5\" target=\"_blank\">'The dark side of AI': Wall Street weighs recent stock sell-off over disruption fears</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Yahoo Finance</font>",
    "link": "https://news.google.com/rss/articles/CBMixwFBVV95cUxNalpQSGdsVlpfUHJQTTFEM2hWREpReS1VTmpseFdhQzFxQ18yVmVGb1lXR3QxUlhDNFoyY3pIMW9jcVZURkY0Z3hma1JUWklVSzhXdU1VcjIteUdWaERGQlFSOGJuU0I0cjJHQkpwelNqal9jaC1tdmEtLW5pUmt3WmxEUjZpS1V0UDJFaWp5MklBcGRXLVQ0LXBaclBMV3Z1YjNPN3hHUW5wcktMSmQyUzl3aThaWFpGN3AtZlpiWTRGV3REOXI4?oc=5"
  },
  {
    "source": "Google News - Stock Market",
    "title": "If a Stock Market Crash Is Coming, This 1 Investing Move Is Critical Right Now - The Motley Fool",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMimAFBVV95cUxPcEJiWV8xY1dlU3hZdXhGYXVhekhYbWs5WXUzZ2ZrM213ZExvNGtUN0NJTTdsRzd6VkdZSXZWb0dkSm1fbEozellHZG55LVM5SjdxNUwwNUlYM1NabFYwNDdsOXFDVDE2X093VnVWM01OcnF4bXJBdEllQzVKeE02YTM4WTJZYWpWZlpnTlgzbVpqQkF3N19fOQ?oc=5\" target=\"_blank\">If a Stock Market Crash Is Coming, This 1 Investing Move Is Critical Right Now</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Motley Fool</font>",
    "link": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPcEJiWV8xY1dlU3hZdXhGYXVhekhYbWs5WXUzZ2ZrM213ZExvNGtUN0NJTTdsRzd6VkdZSXZWb0dkSm1fbEozellHZG55LVM5SjdxNUwwNUlYM1NabFYwNDdsOXFDVDE2X093VnVWM01OcnF4bXJBdEllQzVKeE02YTM4WTJZYWpWZlpnTlgzbVpqQkF3N19fOQ?oc=5"
  },
  {
    "source": "Google News - Stock Market",
    "title": "The Big Scary Myth Stalking the Stock Market - The Wall Street Journal",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMimwNBVV95cUxQZnQ4RGpBanY1Nm9BOHBoclRPeGF5OFRMdVFzRW93ck5zTW5WR0VkM0FxbDdUcThfSVhhM3l2U1h3OEVFc1Q3YUJvT0s2QjVORkdMSTUwR0xZTXNRWlJMMks4dUVRVUVscEpiSW1CMWFfLVRWTnBrLWJzNlZ2azRIQ3R1QU8yWU1fazlKcGJOWk82cW9ocVdfWFUtZWxhbDJOd3NQb216di1rUGF4RmV3bkpLUnlvbkkwazhoMUJwcUJiVDRfdDRBdHEtZmtjTEVpdE5CSGRzd1J5UDJBN3Nqblh0UFBhSmpESXM4RTMyN3VZVm9WcC1MRWFiNldTTUk5SDNJSzVkNmRFc2d6TEQzd2haNFNic3FTWDBlWjBraHN5R3YxMktFdDJlMXFKNmhuMExzSG5DR0ItOGpHU1Y2d3dLTTZzQnZKTzVrOXcwTFNnSV96TDh1Z1lKQ2Q0MWVvdnM5VUQ0anpra2llWVRNazBOTFVGMkdoQ3ZoZDhjZkFORWJsVGZGcldhanViY2Z6MnNBZy1pcVVzLUU?oc=5\" target=\"_blank\">The Big Scary Myth Stalking the Stock Market</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Wall Street Journal</font>",
    "link": "https://news.google.com/rss/articles/CBMimwNBVV95cUxQZnQ4RGpBanY1Nm9BOHBoclRPeGF5OFRMdVFzRW93ck5zTW5WR0VkM0FxbDdUcThfSVhhM3l2U1h3OEVFc1Q3YUJvT0s2QjVORkdMSTUwR0xZTXNRWlJMMks4dUVRVUVscEpiSW1CMWFfLVRWTnBrLWJzNlZ2azRIQ3R1QU8yWU1fazlKcGJOWk82cW9ocVdfWFUtZWxhbDJOd3NQb216di1rUGF4RmV3bkpLUnlvbkkwazhoMUJwcUJiVDRfdDRBdHEtZmtjTEVpdE5CSGRzd1J5UDJBN3Nqblh0UFBhSmpESXM4RTMyN3VZVm9WcC1MRWFiNldTTUk5SDNJSzVkNmRFc2d6TEQzd2haNFNic3FTWDBlWjBraHN5R3YxMktFdDJlMXFKNmhuMExzSG5DR0ItOGpHU1Y2d3dLTTZzQnZKTzVrOXcwTFNnSV96TDh1Z1lKQ2Q0MWVvdnM5VUQ0anpra2llWVRNazBOTFVGMkdoQ3ZoZDhjZkFORWJsVGZGcldhanViY2Z6MnNBZy1pcVVzLUU?oc=5"
  },
  {
    "source": "Google News - Stock Market",
    "title": "Stock Market News for Feb 15, 2026 - Stock Titan",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMiVkFVX3lxTFBLa0FaQmpaUzhVS2xNaV85alJhZzZTYkVhY1VjbTVPeTQwLVNKd0x4YjV3S0hmTk50V2Z5Znk4Zmpxb2tSV3JHWVZwdTBHZ0RvNGQ2Vm9R?oc=5\" target=\"_blank\">Stock Market News for Feb 15, 2026</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Stock Titan</font>",
    "link": "https://news.google.com/rss/articles/CBMiVkFVX3lxTFBLa0FaQmpaUzhVS2xNaV85alJhZzZTYkVhY1VjbTVPeTQwLVNKd0x4YjV3S0hmTk50V2Z5Znk4Zmpxb2tSV3JHWVZwdTBHZ0RvNGQ2Vm9R?oc=5"
  },
  {
    "source": "Google News - Stock Market",
    "title": "Is the stock market open on Presidents Day? - thestreet.com",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMihwFBVV95cUxOWVljQkpOSGp2UjVyN0FYZzg5NS10TE1OQUl4V0E0a01kc0pyMlEwbmtaaDRzb0VyMXpxZVRCdXlNOVJqeG9TU08tNFIzbjYtNDRydDRpdVZCb0xTZlZNYWVLc2hDRkdkb091TUQ2QmxZaGdpZUJCTnpMVnFlTHJ4RHJWbzIyQms?oc=5\" target=\"_blank\">Is the stock market open on Presidents Day?</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">thestreet.com</font>",
    "link": "https://news.google.com/rss/articles/CBMihwFBVV95cUxOWVljQkpOSGp2UjVyN0FYZzg5NS10TE1OQUl4V0E0a01kc0pyMlEwbmtaaDRzb0VyMXpxZVRCdXlNOVJqeG9TU08tNFIzbjYtNDRydDRpdVZCb0xTZlZNYWVLc2hDRkdkb091TUQ2QmxZaGdpZUJCTnpMVnFlTHJ4RHJWbzIyQms?oc=5"
  },
  {
    "source": "Google News - Stock Market",
    "title": "2 Unstoppable Dividend Stocks to Buy if There's a Stock Market Sell-Off - Yahoo Finance",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMihgFBVV95cUxNUldsRU1ZVGIxcDFmTzFMcGFaWFZxNV92Qjdra1Z5cnd1cXgwMUhZUDM0QXo5LXgwdHlhMVBMZ0R3UUlWS1lVbTF3QjM4WmI2MnhLSWZUcnlQbTA2OXlGSEdzNllGQ2YzSnM5cEp1Q2dyMlBEOGJaQ1lsZ0EzMVRFUUMtcWdkQQ?oc=5\" target=\"_blank\">2 Unstoppable Dividend Stocks to Buy if There's a Stock Market Sell-Off</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Yahoo Finance</font>",
    "link": "https://news.google.com/rss/articles/CBMihgFBVV95cUxNUldsRU1ZVGIxcDFmTzFMcGFaWFZxNV92Qjdra1Z5cnd1cXgwMUhZUDM0QXo5LXgwdHlhMVBMZ0R3UUlWS1lVbTF3QjM4WmI2MnhLSWZUcnlQbTA2OXlGSEdzNllGQ2YzSnM5cEp1Q2dyMlBEOGJaQ1lsZ0EzMVRFUUMtcWdkQQ?oc=5"
  },
  {
    "source": "Google News - Stock Market",
    "title": "Will the Stock Market Crash in 2026? Billionaire Ray Dalio Just Gave a Clear Warning to Investors. - The Motley Fool",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMilgFBVV95cUxPNXNQYlYySko1VEtGZVlWUFlyejVHalZVM3laQUpwT2lfNUM3QlU0bGxzTkJwTHNzbjJrVi1SNXNEdW1ZTmpMZXQ3OUtQSlpKS2N1STh1YjNXQkZZRTN0M0tzUktfX0lLbTRPdUFJN2hWcEpWU3h6bVNyUmRIYmpSMzRjUDdTR3hrY19yZW5KTlFBa0dVeEE?oc=5\" target=\"_blank\">Will the Stock Market Crash in 2026? Billionaire Ray Dalio Just Gave a Clear Warning to Investors.</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Motley Fool</font>",
    "link": "https://news.google.com/rss/articles/CBMilgFBVV95cUxPNXNQYlYySko1VEtGZVlWUFlyejVHalZVM3laQUpwT2lfNUM3QlU0bGxzTkJwTHNzbjJrVi1SNXNEdW1ZTmpMZXQ3OUtQSlpKS2N1STh1YjNXQkZZRTN0M0tzUktfX0lLbTRPdUFJN2hWcEpWU3h6bVNyUmRIYmpSMzRjUDdTR3hrY19yZW5KTlFBa0dVeEE?oc=5"
  },
  {
    "source": "Google News - Stock Market",
    "title": "Here are 3 factors that drove the big swings in the stock market last week - CNBC",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMisAFBVV95cUxOSGNFc1NBbV9hWTdJc09DeHBsU2UyejFRNURUZHNHRFNtX1J4QUpnX2liMlF0T1RkNjZxT19wRENxdVU5dFgzN00yRTlDSDNhdWFQT3JvNmszVzljV0NLUWZvWmdwOEh1aHlTXzQwdWpYRlZBQ2NWdVlnVkt5TFE4a05OekNhanpiUm5NSEFRX2hVblQtX3pTNEF6dXZUYmhBSUwtWXBwSUZUYkVmR0RuVQ?oc=5\" target=\"_blank\">Here are 3 factors that drove the big swings in the stock market last week</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CNBC</font>",
    "link": "https://news.google.com/rss/articles/CBMisAFBVV95cUxOSGNFc1NBbV9hWTdJc09DeHBsU2UyejFRNURUZHNHRFNtX1J4QUpnX2liMlF0T1RkNjZxT19wRENxdVU5dFgzN00yRTlDSDNhdWFQT3JvNmszVzljV0NLUWZvWmdwOEh1aHlTXzQwdWpYRlZBQ2NWdVlnVkt5TFE4a05OekNhanpiUm5NSEFRX2hVblQtX3pTNEF6dXZUYmhBSUwtWXBwSUZUYkVmR0RuVQ?oc=5"
  },
  {
    "source": "Google News - Stock Market",
    "title": "2 Unstoppable Dividend Stocks to Buy if There's a Stock Market Sell-Off - The Motley Fool",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMilgFBVV95cUxNc0FtcTNHek9DdU5hV2FwRGRMS2FMMk9PQ0RQb2NxU1ctWXY4elhxd1NkeUZTY20ySGFkcGxpbjVYM25tbENJSTVWY2ZPdm9QZ2xXZ25jSjBXOWdOTkRGclF6V25fLURoblFhOUk3UEd5Y0lWY3BLWlo4R0hsUFJzTUo4RGhYWVR0eTlieXFQbm1sQUZwcHc?oc=5\" target=\"_blank\">2 Unstoppable Dividend Stocks to Buy if There's a Stock Market Sell-Off</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Motley Fool</font>",
    "link": "https://news.google.com/rss/articles/CBMilgFBVV95cUxNc0FtcTNHek9DdU5hV2FwRGRMS2FMMk9PQ0RQb2NxU1ctWXY4elhxd1NkeUZTY20ySGFkcGxpbjVYM25tbENJSTVWY2ZPdm9QZ2xXZ25jSjBXOWdOTkRGclF6V25fLURoblFhOUk3UEd5Y0lWY3BLWlo4R0hsUFJzTUo4RGhYWVR0eTlieXFQbm1sQUZwcHc?oc=5"
  },
  {
    "source": "Google News - Stock Market",
    "title": "Will the Stock Market Open on Presidents Day? - Yahoo Finance",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMihAFBVV95cUxPTHNPNS1QOWNTUkZsSzZzM05CLWd3VFJDUUpLa0dpel9qa0FEaE9PM2VBSGJVanRNTVQ4YjNwaDY1XzZrQlRnZ0NIdjhQNkJmdElXVDdYSGZoSkpmN0Q5U1dVU0puZ2lBbkxIalNBQVJiQ2JpbXVXTl9oTkJnWDRYa0dCdmM?oc=5\" target=\"_blank\">Will the Stock Market Open on Presidents Day?</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Yahoo Finance</font>",
    "link": "https://news.google.com/rss/articles/CBMihAFBVV95cUxPTHNPNS1QOWNTUkZsSzZzM05CLWd3VFJDUUpLa0dpel9qa0FEaE9PM2VBSGJVanRNTVQ4YjNwaDY1XzZrQlRnZ0NIdjhQNkJmdElXVDdYSGZoSkpmN0Q5U1dVU0puZ2lBbkxIalNBQVJiQ2JpbXVXTl9oTkJnWDRYa0dCdmM?oc=5"
  }
]