[
  {
    "source": "Yahoo Finance",
    "title": "Dow Jones Futures Rise; Palantir, Robinhood Earnings Ahead",
    "summary": "The stock market has continued to climb, but it's been tricky. Palantir, Robinhood and AMD lead big earnings this week.",
    "link": "https://finance.yahoo.com/m/62d37222-a461-31e5-bd64-dd1c3cd6bdd9/dow-jones-futures-rise%3B.html?.tsrc=rss"
  },
  {
    "source": "Yahoo Finance",
    "title": "Gold Drops Back Below $4,000 After China Ends Tax Incentive",
    "summary": "Beijing announced Saturday that it would no longer allow some retailers to offset a value-added tax when selling gold they bought from the Shanghai Gold Exchange and Shanghai Futures Exchange, whether sold directly or after processing.  “While Chinese gold demand has played little part in this year’s record bull market, the tax changes in gold’s heaviest consumer nation will dent global sentiment,” said Adrian Ash, director of research at BullionVault.  Most fabricators in China had been deducting value-added tax on inputs when selling downstream to consumers.",
    "link": "https://finance.yahoo.com/news/gold-drops-back-below-4-234719420.html?.tsrc=rss"
  },
  {
    "source": "Yahoo Finance",
    "title": "Stock futures climb as investors await Supreme Court showdown on Trump tariffs and shareholder vote on Musk’s $1 trillion pay package",
    "summary": "On Thursday, Tesla shareholders will gather for the company's annual meeting and will vote on Musk's $1 trillion compensation package.",
    "link": "https://finance.yahoo.com/news/stock-futures-climb-investors-await-001411845.html?.tsrc=rss"
  },
  {
    "source": "Yahoo Finance",
    "title": "Stock market today: Dow, S&P 500, Nasdaq futures climb as November kicks off with earnings, AI, Fed in focus",
    "summary": "US stock futures made gains, with Wall Street looking to maintain upward momentum.",
    "link": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-nasdaq-futures-climb-as-november-kicks-off-with-earnings-ai-fed-in-focus-000604179.html?.tsrc=rss"
  },
  {
    "source": "Yahoo Finance",
    "title": "Gold Falls on Reports of China’s Finance Ministry Ending Tax Incentive for Gold Sales",
    "summary": "Gold fell in the early Asian session on reports that China is ending a tax incentive for sales of the precious metal, effective Nov. 1.",
    "link": "https://finance.yahoo.com/m/521ceaf9-29bd-35d2-a3d6-ca330d9e5301/gold-falls-on-reports-of.html?.tsrc=rss"
  },
  {
    "source": "Yahoo Finance",
    "title": "Tomingley Drilling Discovers New Mineralisation at McLeans",
    "summary": "Underground core drilling at Tomingley is focused on defining extensions to resources as well as improving confidence of Inferred Resources at McLeans and the Western Monzodiorite domain at Roswell. Both McLeans and the Western Monzodiorite are immediately adjacent to existing underground infrastructure. Underground drilling comprising of 9 diamond holes for a total of 3,247 metres was completed to improve the confidence of the Inferred Resource at McLeans. This drilling discovered a second ande",
    "link": "https://finance.yahoo.com/news/tomingley-drilling-discovers-mineralisation-mcleans-233800819.html?.tsrc=rss"
  },
  {
    "source": "Yahoo Finance",
    "title": "Stock Futures Drift Higher to Start a New Month",
    "summary": "Stocks were poised to rise on Monday to kick off a new month of trading after notching gains in October.",
    "link": "https://finance.yahoo.com/m/58e469de-b7ba-3780-b152-677f86e76c86/stock-futures-drift-higher-to.html?.tsrc=rss"
  },
  {
    "source": "Yahoo Finance",
    "title": "History Says the Nasdaq Will Surge in 2026. 1 Stock-Split Stock to Buy Before It Does.",
    "summary": "Data suggest the Nasdaq will continue its growth spurt next year. Buying shares of this high-quality stock-split stock is a great way to profit from the trend.",
    "link": "https://www.fool.com/investing/2025/11/02/history-nasdaq-surge-in-2026-1-stock-split/?.tsrc=rss"
  },
  {
    "source": "Yahoo Finance",
    "title": "This stock-market rally isn’t letting up. Could it be making investors too greedy ahead of year’s end?",
    "summary": "Stocks just logged their best midyear stretch since 1950. Is it time to take some profits?",
    "link": "https://www.marketwatch.com/story/this-stock-market-rally-isnt-letting-up-could-it-be-making-investors-too-greedy-ahead-of-year-end-68245a95?.tsrc=rss"
  },
  {
    "source": "Yahoo Finance",
    "title": "Top 3 Price Prediction Bitcoin, Gold, Silver: Charts Hint at Breakdown as US–China Truce Cools Market Fear",
    "summary": "Bitcoin, gold, and silver may face breakdowns as the US–China trade deal reduces safe-haven demand and momentum weakens across major assets.",
    "link": "https://beincrypto.com/top-3-price-prediction-bitcoin-gold-silver/?.tsrc=rss"
  },
  {
    "source": "Yahoo Finance",
    "title": "Robert Kiyosaki Suggests Bitcoin, Ethereum As Safe Havens Ahead Of Anticipated Market Crash: 'Millions Will Be Wiped Out, Protect Yourself'",
    "summary": "Robert Kiyosaki has once again advocated for Bitcoin and Ethereum as potential safeguards against an impending significant financial crash. Kiyosaki foresees a worldwide economic downturn in November. He shared these thoughts on his X account on Sunday. Kiyosaki cautioned that the crash could obliterate millions of investors, especially those with investments in traditional assets such as stocks or bank savings. He proposed that silver, gold, Bitcoin, and Ethereum could act as defensive investme",
    "link": "https://finance.yahoo.com/news/robert-kiyosaki-suggests-bitcoin-ethereum-174625153.html?.tsrc=rss"
  },
  {
    "source": "Yahoo Finance",
    "title": "Another Rare-Earth Stock Jumps on Government Deal",
    "summary": "The aspiring miner had news about a deal with the government and its plan to develop a terminal where it and other miners could store the minerals.",
    "link": "https://finance.yahoo.com/m/60b41dcc-bf7c-3ec4-a298-1e2d7e453d49/another-rare-earth-stock.html?.tsrc=rss"
  },
  {
    "source": "Yahoo Finance",
    "title": "The Largest Silver Mines In The US Are In These Unexpected Places",
    "summary": "Silver may not be as valuable as gold, but it's a worthy asset to add to your investment portfolio -- with the largest silver mines in the US as your guide.",
    "link": "https://www.moneydigest.com/2012445/largest-silver-mines-in-united-states/?.tsrc=rss"
  },
  {
    "source": "Yahoo Finance",
    "title": "Berkshire Operating Profits Rose 33% in Third Quarter. There Were No Stock Buybacks.",
    "summary": "The company, led by Warren Buffett, reports earnings on Saturday. Buffett has only two months left before he steps down as CEO.",
    "link": "https://finance.yahoo.com/m/1bc475c0-d184-37c9-b103-7e8e51a7f6b9/berkshire-operating-profits.html?.tsrc=rss"
  },
  {
    "source": "Yahoo Finance",
    "title": "3 Safest Investments To Hold In The Current Trump Economy",
    "summary": "The Trump economy is marked by tax cuts, tariffs and shifting Federal Reserve interest-rate policy. Inflation stood at 2.9% in August 2025.",
    "link": "https://finance.yahoo.com/news/3-safest-investments-hold-current-140206295.html?.tsrc=rss"
  },
  {
    "source": "Yahoo Finance",
    "title": "The Chipotle indicator: Is the economy teetering on a recession or nah?",
    "summary": "Is Chipotle a good economic indicator?",
    "link": "https://finance.yahoo.com/news/the-chipotle-indicator-is-the-economy-teetering-on-a-recession-or-nah-133000927.html?.tsrc=rss"
  },
  {
    "source": "Yahoo Finance",
    "title": "Keeping too much cash in your bank account could be a costly mistake — here’s how to know if you’ve got too much",
    "summary": "Learn how much cash you should keep.",
    "link": "https://finance.yahoo.com/news/keeping-too-much-cash-bank-125500572.html?.tsrc=rss"
  },
  {
    "source": "Yahoo Finance",
    "title": "Fed fallout, missing jobs numbers, and a busy earnings calendar: What to watch this week",
    "summary": "Markets look set to enter the fifth full week of a US government shutdown as investors parse Powell's comments, news of a trade deal between Washington and Beijing, and another mammoth week of earnings.",
    "link": "https://finance.yahoo.com/news/fed-fallout-missing-jobs-numbers-and-a-busy-earnings-calendar-what-to-watch-this-week-124032500.html?.tsrc=rss"
  },
  {
    "source": "Yahoo Finance",
    "title": "AI Spending Crisis: Meta and Microsoft Stock Dives as Big Tech Faces a Shifting Future",
    "summary": "Soaring AI Costs and Fed Uncertainty Shake Markets",
    "link": "https://finance.yahoo.com/news/ai-spending-crisis-meta-microsoft-114044715.html?.tsrc=rss"
  },
  {
    "source": "Yahoo Finance",
    "title": "If You'd Invested $1,000 in Shiba Inu 5 Years Ago, Here's How Much You'd Have Today",
    "summary": "Shiba Inu has posted astronomical returns during the last five years.",
    "link": "https://www.fool.com/investing/2025/11/02/if-youd-invested-1000-in-shib-5-years-ago-heres-ho/?.tsrc=rss"
  },
  {
    "source": "CNBC News",
    "title": "Interest rate backdrop supports playing offense with bonds, according to Goldman Sachs former ETF head",
    "summary": "BondBloxx’s Tony Kelly tackles fixed income opportunities.",
    "link": "https://www.cnbc.com/2025/11/01/bonds-fed-rate-cuts-former-goldman-sachs-etf-head.html"
  },
  {
    "source": "CNBC News",
    "title": "Berkshire's operating earnings jump 34%, Buffett buys back no stock and raises cash hoard to $381 billion",
    "summary": "Berkshire's operating profit generated from the conglomerate's wholly owned businesses including insurance and railroads jumped 34% in the third quarter.",
    "link": "https://www.cnbc.com/2025/11/01/berkshire-hathaway-brk-earnings-q3-2025.html"
  },
  {
    "source": "CNBC News",
    "title": "Stocks making the biggest moves midday: Amazon, Twilio, Reddit, Cloudflare, First Solar and more",
    "summary": "These are some of the stocks posting the largest moves midday.",
    "link": "https://www.cnbc.com/2025/10/31/stocks-making-the-biggest-moves-midday-amzn-twlo-rddt-net-fslr.html"
  },
  {
    "source": "CNBC News",
    "title": "More retirement investors opting for 'good enough' stock portfolio strategy to protect their market money",
    "summary": "Retirees are in a tough spot needing stock market growth to fight inflation, but their personal finance plans can't stomach a major market correction.",
    "link": "https://www.cnbc.com/2025/10/31/more-retirees-opting-for-good-enough-stock-strategy-to-protect-money.html"
  },
  {
    "source": "CNBC News",
    "title": "Stocks making the biggest moves premarket: Brighthouse Financial, Amazon, Ramaco Resources and more",
    "summary": "These are some of the stocks posting the largest moves in premarket trading.",
    "link": "https://www.cnbc.com/2025/10/31/stocks-making-big-moves-premarket-brighthouse-financial-amazon-and-more.html"
  },
  {
    "source": "CNBC News",
    "title": "Pony.ai becomes first to win citywide robotaxi permit in China's Silicon Valley",
    "summary": "Pony.ai said it is the first company to get a permit to operate taxis across all of the Chinese city of Shenzhen on the border of Hong Kong.",
    "link": "https://www.cnbc.com/2025/10/31/chinas-ponyai-gets-the-first-permit-for-robotaxis-in-all-of-shenzhen.html"
  },
  {
    "source": "CNBC News",
    "title": "China's Xi urges Asian nations to keep supply chains stable, work together during ‘turbulent’ times",
    "summary": "Chinese President Xi Jinping played up how Beijing is a proponent of stable supply chains and free trade in a speech Friday.",
    "link": "https://www.cnbc.com/2025/10/31/chinas-xi-urges-asian-nations-to-keep-supply-chains-stable-work-together-during-turbulent-times.html"
  },
  {
    "source": "CNBC News",
    "title": "Stocks making the biggest moves after hours: Apple, Amazon, Coinbase, Netflix and more",
    "summary": "These are the stocks posting the largest moves in extended trading.",
    "link": "https://www.cnbc.com/2025/10/30/stocks-making-the-biggest-moves-after-hours-aapl-amzn-coin-nflx-and-more.html"
  },
  {
    "source": "CNBC News",
    "title": "Powell forced to stave off uprisings in markets and on his own Fed board as his term ends",
    "summary": "Powell faces if not the most difficult challenge of his time in office at least the trickiest.",
    "link": "https://www.cnbc.com/2025/10/30/powell-forced-to-stave-off-uprisings-in-markets-and-on-his-own-fed-board-as-his-term-ends.html"
  },
  {
    "source": "CNBC News",
    "title": "Food inflation is killing Chipotle. Wall Street sees little way out for company if it doesn't raise prices",
    "summary": "Analysts are zeroing in on the potential impact of food inflation to margins and earnings.",
    "link": "https://www.cnbc.com/2025/10/30/food-inflation-is-killing-chipotle-wall-street-sees-little-way-out-for-company-if-it-doesnt-raise-prices.html"
  },
  {
    "source": "CNBC News",
    "title": "Stocks making the biggest moves midday: Cigna, FormFactor, Meta Platforms, Microsoft, Carvana & more",
    "summary": "These are the stocks posting the largest moves midday.",
    "link": "https://www.cnbc.com/2025/10/30/stocks-making-the-biggest-moves-midday-ci-form-meta-msft-cvna.html"
  },
  {
    "source": "CNBC News",
    "title": "Stocks making the biggest moves premarket: Alphabet, Microsoft, Meta Platforms, Eli Lilly, Merck & more",
    "summary": "These are some of the stocks posting the largest moves in early trading.",
    "link": "https://www.cnbc.com/2025/10/30/stocks-making-the-biggest-moves-premarket-googl-msft-meta-lly-mrk.html"
  },
  {
    "source": "CNBC News",
    "title": "China says it’s willing to work with U.S. on TikTok — but offers few details",
    "summary": "Beijing indicated it would work with the U.S. on addressing the future of TikTok in the country.",
    "link": "https://www.cnbc.com/2025/10/30/china-says-its-willing-to-work-with-us-on-tiktok.html"
  },
  {
    "source": "CNBC News",
    "title": "Beijing’s buzzing after Trump-Xi talks and betting a trade ‘honeymoon’ could be next",
    "summary": "As Chinese President Xi Jinping and U.S. President Donald Trump met Thursday, many people in China cheered the in-person meeting.",
    "link": "https://www.cnbc.com/2025/10/30/xi-trump-meeting-sparks-optimism-in-china-but-many-wonder-what-comes-next.html"
  },
  {
    "source": "CNBC News",
    "title": "Chinese e-commerce giants now dominate Southeast Asia’s online shopping scene",
    "summary": "ByteDance's TikTok Shop and Alibaba's AliExpress are going global — taking large chunks of the overseas e-commerce market, according to Bain and Company.",
    "link": "https://www.cnbc.com/2025/10/30/chinese-companies-have-begun-to-dominate-southeast-asias-online-shopping-market.html"
  },
  {
    "source": "CNBC News",
    "title": "Here are the five key takeaways from the Fed meeting and Powell news conference",
    "summary": "The Federal Reserve meeting that wrapped up Wednesday both delivered on expectations and offered a few surprises.",
    "link": "https://www.cnbc.com/2025/10/29/fed-five-takeaways.html"
  },
  {
    "source": "CNBC News",
    "title": "Stocks making the biggest moves after hours: Alphabet, Meta, Starbucks, Microsoft and more",
    "summary": "These are the stocks posting the largest moves in extended trading.",
    "link": "https://www.cnbc.com/2025/10/29/stocks-making-the-biggest-moves-after-hours-alphabet-meta-starbucks-microsoft-and-more.html"
  },
  {
    "source": "CNBC News",
    "title": "DoubleLine’s Gundlach cuts gold exposure to 10%, urges investors to rebalance after  'nosebleed' rally",
    "summary": "DoubleLine Capital CEO Jeffrey Gundlach is dialing back his exposure to gold after the metal's powerful run this year,",
    "link": "https://www.cnbc.com/2025/10/29/doublelines-gundlach-cuts-gold-exposure-to-10percent-after-nosebleed-rally.html"
  },
  {
    "source": "CNBC News",
    "title": "There were two Fed dissenters: Miran wanted a bigger cut and Schmid voted for no easing at all",
    "summary": "Federal Reserve Governor Stephen Miran instead called for a half-point cut, while Kansas City Fed President Jeffrey Schmid voted for no decrease.",
    "link": "https://www.cnbc.com/2025/10/29/there-were-two-fed-dissenters-miran-wanted-a-bigger-cut-and-schmid-voted-for-no-easing-at-all.html"
  },
  {
    "source": "CNBC News",
    "title": "Here's what changed in the new Fed statement",
    "summary": "This is a comparison of Wednesday's Federal Open Market Committee statement with the one issued after the Fed's previous policymaking meeting in September.",
    "link": "https://www.cnbc.com/2025/10/29/october-fed-statement-heres-what-changed-in-the-new-statement.html"
  },
  {
    "source": "Financial Times World News",
    "title": "City bosses warn on pay as UK minimum wage closes in on graduate salaries",
    "summary": "Chief executives voice fears about impact on recruitment ahead of expected rise in Budget",
    "link": "https://www.ft.com/content/b436f945-be2b-47ff-ad80-b94540a4d077"
  },
  {
    "source": "Financial Times World News",
    "title": "Train stabbing fuels UK public’s feeling of insecurity",
    "summary": "Cambridgeshire attack is second mass knife crime incident in less than a week",
    "link": "https://www.ft.com/content/f784b070-c6b0-4175-9be1-c14b1bb8f8a9"
  },
  {
    "source": "Financial Times World News",
    "title": "Elon Musk’s Grokipedia is a major own goal",
    "summary": "Humans might be highly imperfect and biased but they are still better than AI at getting to the truth",
    "link": "https://www.ft.com/content/5ada1835-bdee-4326-adc0-e90a33123588"
  },
  {
    "source": "Financial Times World News",
    "title": "A welcome revival of the Dutch political centre",
    "summary": "The liberal D66 are the big winners of the Netherlands election. So is Europe",
    "link": "https://www.ft.com/content/37f287ad-78f1-483a-8981-772b9e0bdbe5"
  },
  {
    "source": "Financial Times World News",
    "title": "One remaining suspect held in train stabbing case as police say no suggestion of terrorism",
    "summary": "Man arrested on suspicion of attempted murder is British national born in the UK",
    "link": "https://www.ft.com/content/ebad259e-222b-48c1-9312-fa33b62add31"
  },
  {
    "source": "Financial Times World News",
    "title": "London becomes ‘quant’ powerhouse as traders rake in revenues",
    "summary": "A pipeline of skilled graduates is helping the UK build out its expertise in algorithmic trading",
    "link": "https://www.ft.com/content/8a6502c3-f244-4b61-880b-b20cf03299cc"
  },
  {
    "source": "Financial Times World News",
    "title": "UK small businesses struggling to take advantage of trade deals",
    "summary": "British Chambers of Commerce urge ministers to do more to help exporters",
    "link": "https://www.ft.com/content/451e06ff-407a-4332-acbb-e7e63adedd4b"
  },
  {
    "source": "Financial Times World News",
    "title": "Tech groups step up efforts to solve AI’s big security flaw",
    "summary": "Google DeepMind, Anthropic and Microsoft are trying to prevent ‘indirect prompt injection attacks’ by hackers",
    "link": "https://www.ft.com/content/56cb100e-7146-488f-aae5-55304ae0eff6"
  },
  {
    "source": "Google News - Stock Market",
    "title": "Stock market today: Dow, S&P 500, Nasdaq futures climb as November kicks off with earnings, AI, Fed in focus - Yahoo Finance",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMi6AFBVV95cUxQSXdZcDhUdjRKSHJtTDR4SUlJTG1NVEw0VTNadE1XOTQ3N1EzeU9MeWo3MExtTFh6ak9oeklZUVZuMV9lQzNBYVVPSTlNVXFwNzJGU3lmdFpOUlVlLWZtWFI1Qi1QUWJlZVJIcGdXc240dEhFX0ZTVjR2VXJ1U2pIZ3lxVlBqVUhuY2RGblRQU3NSNFZkRTAtRi1zd0puZmQzekI1c0xFOFJfazJMUHdzX3NNY0d0OGx3SGZtQVNZeE1Pa0d6d0JYMjNrMHd2MzVjWDIyOUVYSzU0dVhPeWJHRWIxWWxPTXVS?oc=5\" target=\"_blank\">Stock market today: Dow, S&amp;P 500, Nasdaq futures climb as November kicks off with earnings, AI, Fed in focus</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Yahoo Finance</font>",
    "link": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxQSXdZcDhUdjRKSHJtTDR4SUlJTG1NVEw0VTNadE1XOTQ3N1EzeU9MeWo3MExtTFh6ak9oeklZUVZuMV9lQzNBYVVPSTlNVXFwNzJGU3lmdFpOUlVlLWZtWFI1Qi1QUWJlZVJIcGdXc240dEhFX0ZTVjR2VXJ1U2pIZ3lxVlBqVUhuY2RGblRQU3NSNFZkRTAtRi1zd0puZmQzekI1c0xFOFJfazJMUHdzX3NNY0d0OGx3SGZtQVNZeE1Pa0d6d0JYMjNrMHd2MzVjWDIyOUVYSzU0dVhPeWJHRWIxWWxPTXVS?oc=5"
  },
  {
    "source": "Google News - Stock Market",
    "title": "Stock futures are little changed to start November trading: Live updates - CNBC",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMid0FVX3lxTE9lSmw5WWVPYlMyU3R0SjBzb1lXT1pzN1NpcHgxUFc2UmdWVTEtMlNJVUZ2aGVUeHlRb0JDbjN3RklQQXU3OEl3b0pKbGl4TkR5YTlxSUROYzlPMTlhM3VtZmE4TmtxT3B3R0JxSVU1cmhTbHlLTW9j0gF8QVVfeXFMTkxmODJjZDBHNnZKZWdCdlRzRjgwekxpUjl2bVBjSEVLQkc0aG9UaTBxa1ppM0Z6bWFiR1JiTW9KdUd5YmkzTGhsbFgtQlZFa0c1aGY1OHNfMmtMakh1R3ZETWgydjMzSVZZYTNoOEROMXNWSmFfUl9USHVQRw?oc=5\" target=\"_blank\">Stock futures are little changed to start November trading: Live updates</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CNBC</font>",
    "link": "https://news.google.com/rss/articles/CBMid0FVX3lxTE9lSmw5WWVPYlMyU3R0SjBzb1lXT1pzN1NpcHgxUFc2UmdWVTEtMlNJVUZ2aGVUeHlRb0JDbjN3RklQQXU3OEl3b0pKbGl4TkR5YTlxSUROYzlPMTlhM3VtZmE4TmtxT3B3R0JxSVU1cmhTbHlLTW9j0gF8QVVfeXFMTkxmODJjZDBHNnZKZWdCdlRzRjgwekxpUjl2bVBjSEVLQkc0aG9UaTBxa1ppM0Z6bWFiR1JiTW9KdUd5YmkzTGhsbFgtQlZFa0c1aGY1OHNfMmtMakh1R3ZETWgydjMzSVZZYTNoOEROMXNWSmFfUl9USHVQRw?oc=5"
  },
  {
    "source": "Google News - Stock Market",
    "title": "Since ChatGPT launched, job openings are down 30% while the stock market is up 70%. One economist says the true culprit isn’t AI, but monetary policy - Fortune",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMiwAFBVV95cUxNTjdaYVNrMEhDSjJnVXh5Wmc4LVFtLUN2a1NBclhsNVhSRS0zTTJiMnNlWVR6TS1ieC1vS1dRMTR2VVhYcFJUcUY1SnE4UG9FX0ljVm5pZmF6ZlhlbkMzTm10STVudjJnTkNPTUpEU0hHWGtHVFBoalBxLVdnWVdKSzVZdkhvUTgyR21zOFVyQ1RmWGM2eVpHSHo2VDRRZkZ4SWFzSGY0aUpNVzdKZDlqOGUyT28wcHZXc1lIVE96ajc?oc=5\" target=\"_blank\">Since ChatGPT launched, job openings are down 30% while the stock market is up 70%. One economist says the true culprit isn’t AI, but monetary policy</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Fortune</font>",
    "link": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxNTjdaYVNrMEhDSjJnVXh5Wmc4LVFtLUN2a1NBclhsNVhSRS0zTTJiMnNlWVR6TS1ieC1vS1dRMTR2VVhYcFJUcUY1SnE4UG9FX0ljVm5pZmF6ZlhlbkMzTm10STVudjJnTkNPTUpEU0hHWGtHVFBoalBxLVdnWVdKSzVZdkhvUTgyR21zOFVyQ1RmWGM2eVpHSHo2VDRRZkZ4SWFzSGY0aUpNVzdKZDlqOGUyT28wcHZXc1lIVE96ajc?oc=5"
  },
  {
    "source": "Google News - Stock Market",
    "title": "Futures Rise; 3 Stocks In Buy Areas With Big Earnings Due - Investor's Business Daily",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMiswFBVV95cUxQNUs0cnd6aUR5dW1vc093bHVrZVh4NkljZGt0OHN4V2c5Mk1acERBRldfREVqYWJ4SHVaNmFDLW5sa091WEdoN3I4YzRMSDV4RlZrV19LbHpVTGEyb183MWdMTU9sU2JyZTA4T0NvSHdFVDhRUXAzNWFpTk1UdklXak5ZMEgxNjBCNEVtNGlrbGNncW9QZTl4Skk0c1dtVWY5NUdFSVRkUllrWnhTVmc2SERYaw?oc=5\" target=\"_blank\">Futures Rise; 3 Stocks In Buy Areas With Big Earnings Due</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Investor's Business Daily</font>",
    "link": "https://news.google.com/rss/articles/CBMiswFBVV95cUxQNUs0cnd6aUR5dW1vc093bHVrZVh4NkljZGt0OHN4V2c5Mk1acERBRldfREVqYWJ4SHVaNmFDLW5sa091WEdoN3I4YzRMSDV4RlZrV19LbHpVTGEyb183MWdMTU9sU2JyZTA4T0NvSHdFVDhRUXAzNWFpTk1UdklXak5ZMEgxNjBCNEVtNGlrbGNncW9QZTl4Skk0c1dtVWY5NUdFSVRkUllrWnhTVmc2SERYaw?oc=5"
  },
  {
    "source": "Google News - Stock Market",
    "title": "This stock-market rally isn’t letting up. Could it be making investors too greedy ahead of year’s end? - MarketWatch",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMi3ANBVV95cUxNLVVVZGdwXzBxaWl1RFFIeGNaendoZXBXZjEta0hpd0gyMTZBelhvMUg4TmZPOUViUkF2TFdhbTg3a1dJRzRrSkRhQTJETjRxcmdRVE5vaW51WnluWkFEQnhFWE0zemk1MTNVRC1aX3FZYjFKdGZXQXR2bTBmRC1aRmpWT3VqVEdmbnpoWkhjMGd0MnIyaFg1MjVHOFN2MV9EYTZzLWRmdzZibUpRRjk1cEtNQkRoSmJVYUxVZW5OcTBiOU5hbFhiLUlTMmpXYWFmU0J2YV9rcFNESm9vNHZuV3hwdFZabURHX19SOUxHUGhPVDA0VW40bkc4RWVVRnpmQ0Q0VFE1SjJZMXozZzBIWnVqME5uVWRRSzBjR0tjdUczTUEwUlpUeTYyYlRmODJjVC1tbGxXcWJGQlNNcko5V0NqTVdwMFFoUElSSGpkZEY2MndPaUMzNVZHWW1fbmJxbW85V2MwVm9RY01tTWYxeU1SWVFQTTFPMDloMGxuVTB3NktESUJEUFBVNVhKRmJReElrVmlvWWIyRks1TS1BZGp0VUdxOVNWazUzX2UyMEpqQ1ZjYkJUNy12TGc1MS1pbk9qQWI2ZkpQVTJFUkJLYnRRSHBfbWxOUlktaw?oc=5\" target=\"_blank\">This stock-market rally isn’t letting up. Could it be making investors too greedy ahead of year’s end?</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">MarketWatch</font>",
    "link": "https://news.google.com/rss/articles/CBMi3ANBVV95cUxNLVVVZGdwXzBxaWl1RFFIeGNaendoZXBXZjEta0hpd0gyMTZBelhvMUg4TmZPOUViUkF2TFdhbTg3a1dJRzRrSkRhQTJETjRxcmdRVE5vaW51WnluWkFEQnhFWE0zemk1MTNVRC1aX3FZYjFKdGZXQXR2bTBmRC1aRmpWT3VqVEdmbnpoWkhjMGd0MnIyaFg1MjVHOFN2MV9EYTZzLWRmdzZibUpRRjk1cEtNQkRoSmJVYUxVZW5OcTBiOU5hbFhiLUlTMmpXYWFmU0J2YV9rcFNESm9vNHZuV3hwdFZabURHX19SOUxHUGhPVDA0VW40bkc4RWVVRnpmQ0Q0VFE1SjJZMXozZzBIWnVqME5uVWRRSzBjR0tjdUczTUEwUlpUeTYyYlRmODJjVC1tbGxXcWJGQlNNcko5V0NqTVdwMFFoUElSSGpkZEY2MndPaUMzNVZHWW1fbmJxbW85V2MwVm9RY01tTWYxeU1SWVFQTTFPMDloMGxuVTB3NktESUJEUFBVNVhKRmJReElrVmlvWWIyRks1TS1BZGp0VUdxOVNWazUzX2UyMEpqQ1ZjYkJUNy12TGc1MS1pbk9qQWI2ZkpQVTJFUkJLYnRRSHBfbWxOUlktaw?oc=5"
  },
  {
    "source": "Google News - Stock Market",
    "title": "5 major stock market risks - Fidelity",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMihgFBVV95cUxQSlB4UnZEUXBveDU0SXVfR2RSblRKalNYVUhXNV9Zd1NhUk1ZbFQ2QXF6NTFGTkc5WERGMmNBM0ZPOXdjS0daRUdSSWVHQ1RxX29yOUNnSzFaZHZxeGZqTEpwNWkxZno5SVFMcW1Ba0NQekltb2hFOGlMTV9BWFFZNXhNbjdZdw?oc=5\" target=\"_blank\">5 major stock market risks</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Fidelity</font>",
    "link": "https://news.google.com/rss/articles/CBMihgFBVV95cUxQSlB4UnZEUXBveDU0SXVfR2RSblRKalNYVUhXNV9Zd1NhUk1ZbFQ2QXF6NTFGTkc5WERGMmNBM0ZPOXdjS0daRUdSSWVHQ1RxX29yOUNnSzFaZHZxeGZqTEpwNWkxZno5SVFMcW1Ba0NQekltb2hFOGlMTV9BWFFZNXhNbjdZdw?oc=5"
  },
  {
    "source": "Google News - Stock Market",
    "title": "Philippines Seeks Fix for World’s Worst-Performing Stock Market - Bloomberg.com",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMitAFBVV95cUxOVkRlTTRYWmVlS2hsRDdkVm9lN204a1E2d1phRTZhVXNVaEYzTTFPZi1PUU84N3laVkliUnpwYWNmWVp0Yi1YXzUzaXJZQnBrb1pHVV9DVW91Y1NfdnVzZDE4dWhCOVVULUdNSTBxc2o0TUZmVFJuMGJUWWRkZGllNkN1cmVVUVNQLUFodENDNXl0X1hyZFU3bWgtRGNQQU1mNm9oRHFJU1hoaDI1VWhhV1hWR0c?oc=5\" target=\"_blank\">Philippines Seeks Fix for World’s Worst-Performing Stock Market</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Bloomberg.com</font>",
    "link": "https://news.google.com/rss/articles/CBMitAFBVV95cUxOVkRlTTRYWmVlS2hsRDdkVm9lN204a1E2d1phRTZhVXNVaEYzTTFPZi1PUU84N3laVkliUnpwYWNmWVp0Yi1YXzUzaXJZQnBrb1pHVV9DVW91Y1NfdnVzZDE4dWhCOVVULUdNSTBxc2o0TUZmVFJuMGJUWWRkZGllNkN1cmVVUVNQLUFodENDNXl0X1hyZFU3bWgtRGNQQU1mNm9oRHFJU1hoaDI1VWhhV1hWR0c?oc=5"
  },
  {
    "source": "Google News - Stock Market",
    "title": "Stock Market News, October 31, 2025: Amazon Surges to Record High, Boosting Nasdaq - The Wall Street Journal",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMijANBVV95cUxQZkNDOFphSkFwRVFsQmRsNU9Zc2VBVnJnbTRZRXg0eTl3TGk5SEl6RllpZmVDUWdOTDdRalgtWFZWUzFOLU1VaVh3M25TN3dCaUdUZEVBLXVCeUU1OWgwOXlGUGNaVmM1d1k2MEwwSWVVc1M4S1NWdXVCYndtZl9TWnVyN3JyU3RUM0VyTnUxT2ZpNEhGZ2ZsVVc2NEdLRE1haW05MDRhMkhSOWNCdnFNMm94VjhYR0RXbzNyXzQwQ3ZNS3NTY2ttbDl1UTFpcG9UZU9VaVVBVUFLTXNiemc0eV85WUItTWhnYWRMQkY1MGU1TThCMTRfM1BNa2VsdUxNRTdpYldDWHJpWVZtY0VJRjIwM25MZHdUQkNaYVY2cF9wUWNLSE1ZNHNaajRkUVJnYndqbHpNLVVQd2g3eWw2bnJmUG45SFZMTGJJRUs2YzYyQXBRZGx3b1R1UzhlWEJNZGs4c2pMcXFIV29WMzA3emxMckVLbGxvM3FWVTcwOVphV0EyX1Ria1JXV28?oc=5\" target=\"_blank\">Stock Market News, October 31, 2025: Amazon Surges to Record High, Boosting Nasdaq</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Wall Street Journal</font>",
    "link": "https://news.google.com/rss/articles/CBMijANBVV95cUxQZkNDOFphSkFwRVFsQmRsNU9Zc2VBVnJnbTRZRXg0eTl3TGk5SEl6RllpZmVDUWdOTDdRalgtWFZWUzFOLU1VaVh3M25TN3dCaUdUZEVBLXVCeUU1OWgwOXlGUGNaVmM1d1k2MEwwSWVVc1M4S1NWdXVCYndtZl9TWnVyN3JyU3RUM0VyTnUxT2ZpNEhGZ2ZsVVc2NEdLRE1haW05MDRhMkhSOWNCdnFNMm94VjhYR0RXbzNyXzQwQ3ZNS3NTY2ttbDl1UTFpcG9UZU9VaVVBVUFLTXNiemc0eV85WUItTWhnYWRMQkY1MGU1TThCMTRfM1BNa2VsdUxNRTdpYldDWHJpWVZtY0VJRjIwM25MZHdUQkNaYVY2cF9wUWNLSE1ZNHNaajRkUVJnYndqbHpNLVVQd2g3eWw2bnJmUG45SFZMTGJJRUs2YzYyQXBRZGx3b1R1UzhlWEJNZGs4c2pMcXFIV29WMzA3emxMckVLbGxvM3FWVTcwOVphV0EyX1Ria1JXV28?oc=5"
  },
  {
    "source": "Google News - Stock Market",
    "title": "Safety strategies for a bubble market - Financial Times",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMicEFVX3lxTE0wNzlPT0JsVWs3aGowcG4wMjJzbDNndjhYc3NqcklqaTZuV25sSm9ReHlGZDd0WUlvdG0wTHZuWV9mRUE3QTRZeWZ5VXhoZUJYT1RqUEc3TlNFa1ZHUzVHa3l0Nzl1MFpkc2paMlpYVGY?oc=5\" target=\"_blank\">Safety strategies for a bubble market</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Financial Times</font>",
    "link": "https://news.google.com/rss/articles/CBMicEFVX3lxTE0wNzlPT0JsVWs3aGowcG4wMjJzbDNndjhYc3NqcklqaTZuV25sSm9ReHlGZDd0WUlvdG0wTHZuWV9mRUE3QTRZeWZ5VXhoZUJYT1RqUEc3TlNFa1ZHUzVHa3l0Nzl1MFpkc2paMlpYVGY?oc=5"
  },
  {
    "source": "Google News - Stock Market",
    "title": "Will the Stock Market Soar or Crash Under President Donald Trump in 2026? Here's What History Shows. - The Motley Fool",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMilgFBVV95cUxOcXpXSTcxMTJDLXlHaUZBRl9lOHo3Vkc1T28wZm5id0VsOGNud3ZrTTAtR2UzUzJZaEcycGRFbXFWYmh2SEFITFk1RDkwVENvQ3dXQW1UejFxNmo2N0pQRWhhekZIRk9jMHNDZnFVbThTNDdIT0NNdE0wWXNBX2Q2X09WSUZhWEM2TEtFaVk4eVVsNlc1elE?oc=5\" target=\"_blank\">Will the Stock Market Soar or Crash Under President Donald Trump in 2026? Here's What History Shows.</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Motley Fool</font>",
    "link": "https://news.google.com/rss/articles/CBMilgFBVV95cUxOcXpXSTcxMTJDLXlHaUZBRl9lOHo3Vkc1T28wZm5id0VsOGNud3ZrTTAtR2UzUzJZaEcycGRFbXFWYmh2SEFITFk1RDkwVENvQ3dXQW1UejFxNmo2N0pQRWhhekZIRk9jMHNDZnFVbThTNDdIT0NNdE0wWXNBX2Q2X09WSUZhWEM2TEtFaVk4eVVsNlc1elE?oc=5"
  }
]