[
  {
    "source": "Yahoo Finance",
    "title": "Dow Jones Futures Rise With Tesla Deliveries, Jobs Report Due; 5 Stocks Eye Buy Points",
    "summary": "The major indexes bounced to end the week. Palantir, DoorDash are near buy points. Tesla deliveries, jobs date and a possible government shutdown loom.",
    "link": "https://finance.yahoo.com/m/18031d71-85bc-38ca-a9ce-bf4930d4193f/dow-jones-futures-rise-with.html?.tsrc=rss"
  },
  {
    "source": "Yahoo Finance",
    "title": "Stock market today: Dow, S&P 500, Nasdaq futures edge up with government shutdown in focus",
    "summary": "Wall Street is hoping to bounce back from a losing week as futures edge up ahead of a looming shutdown.",
    "link": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-nasdaq-futures-edge-up-with-government-shutdown-in-focus-001134200.html?.tsrc=rss"
  },
  {
    "source": "Yahoo Finance",
    "title": "Gold Rises Amid Fed Rate-Cut Hopes",
    "summary": "PRECIOUS METALS 2345 GMT — Gold rises in early Asian trade amid hopes for Fed rate cuts that would enhance the allure of the non-interest-bearing precious metal. U.S. economic data released last Friday showed the Fed’s preferred inflation gauge met expectations.",
    "link": "https://finance.yahoo.com/m/625d9c71-5e00-3e64-99ce-132cb9cf7f34/gold-rises-amid-fed-rate-cut.html?.tsrc=rss"
  },
  {
    "source": "Yahoo Finance",
    "title": "Sprott Inc. (SII): A Bull Case Theory",
    "summary": "We came across a bullish thesis on Sprott Inc. on FluentInQuality’s Substack. In this article, we will summarize the bulls’ thesis on SII. Sprott Inc.’s share was trading at $71.90 as of September 18th. SII’s trailing and forward P/E were 37.06 and 26.95, respectively according to Yahoo Finance. Sprott Inc. is a global asset manager specializing in […]",
    "link": "https://finance.yahoo.com/news/sprott-inc-sii-bull-case-202039779.html?.tsrc=rss"
  },
  {
    "source": "Yahoo Finance",
    "title": "Ripple (XRP) Price Analysis: $5 Forecasts Surge on Kalshi as Kraken Whale Moves 17,555,420 XRP",
    "summary": "Ripple (XRP) prices found firm support at the $2.80 level on Sunday, Sept 28, after closing the week with a 4% rebound from its 75-day low of $2.74 recorded last Thursday. While broader crypto sentiment remained subdued, critical XRP market movements suggest a more optimistic response after the resilient close ...",
    "link": "https://www.coinspeaker.com/ripple-xrp-price-analysis-5-forecasts-surge-on-kalshi-as-kraken-whale-moves-17555420-xrp/?.tsrc=rss"
  },
  {
    "source": "Yahoo Finance",
    "title": "Schiff Challenges Saylor’s Bitcoin Bet, Analyst Says Sub-$107K BTC Is a 'Tremendous Buying Opportunity’",
    "summary": "James van Straten sees a slow grind with 10–20% pullbacks while Michaël van de Poppe flags $112K as the trigger for an altcoin rally.",
    "link": "https://www.coindesk.com/markets/2025/09/28/schiff-challenges-saylor-s-bitcoin-bet-analyst-says-sub-usd107k-btc-is-a-tremendous-buying-opportunity?.tsrc=rss"
  },
  {
    "source": "Yahoo Finance",
    "title": "MSTR Stock Crash Pattern to Repeat Again? Schiff Advises Saylor",
    "summary": "Ever since hitting the highs of $442 in July this year, the Strategy (MSTR) stock has been moving sideways, eroding all of the 2025 gains, as per the $309 closing price on Friday, September 26. Market analysts note that the MSTR stock is echoing the 2021-2023 fractal pattern, which triggered ...",
    "link": "https://www.coinspeaker.com/mstr-stock-crash-pattern-to-repeat-again-peter-schiff-advises-michael-saylor/?.tsrc=rss"
  },
  {
    "source": "Yahoo Finance",
    "title": "'The new normal': Wall Street says high stock valuations may be here to stay",
    "summary": "Wall Street strategists say lofty stock valuations could represent a “new normal” in an AI-fueled market with strong earnings momentum.",
    "link": "https://finance.yahoo.com/news/the-new-normal-wall-street-says-high-stock-valuations-may-be-here-to-stay-150022468.html?.tsrc=rss"
  },
  {
    "source": "Yahoo Finance",
    "title": "Shutdown looms as September jobs data, third quarter finale await investors: What to watch this week",
    "summary": "A looming government shutdown could delay the release of the crucial September jobs report, in what is shaping up to be an eventful week for investors.",
    "link": "https://finance.yahoo.com/news/shutdown-looms-as-september-jobs-data-third-quarter-finale-await-investors-what-to-watch-this-week-114203007.html?.tsrc=rss"
  },
  {
    "source": "Yahoo Finance",
    "title": "A Look at Collective Mining (TSX:CNL) Valuation Following S&P Global BMI Index Inclusion",
    "summary": "Collective Mining (TSX:CNL) just notched a major milestone, landing a spot in the S&amp;P Global BMI Index. For investors, this kind of index addition tends to bring a fresh wave of visibility and can trigger a marked bump in trading volume as passive funds and ETFs rebalance. It is the sort of event that signals Collective Mining is no longer just on the radar of small-cap enthusiasts; it has formally joined the ranks of globally tracked opportunities, which can draw fresh capital and wider...",
    "link": "https://finance.yahoo.com/news/look-collective-mining-tsx-cnl-111741793.html?.tsrc=rss"
  },
  {
    "source": "Yahoo Finance",
    "title": "Why Reddit Stock Sank This Week",
    "summary": "Even after falling 9% this week, Reddit stock is still up 47% this year.",
    "link": "https://www.fool.com/investing/2025/09/28/why-reddit-stock-sank-this-week/?.tsrc=rss"
  },
  {
    "source": "Yahoo Finance",
    "title": "Why Astera Labs Stock Plummeted This Week",
    "summary": "Are investors falling out of love with Astera Labs stock?",
    "link": "https://www.fool.com/investing/2025/09/28/why-astera-labs-stock-plummeted-this-week/?.tsrc=rss"
  },
  {
    "source": "Yahoo Finance",
    "title": "Why AST SpaceMobile Stock Soared This Week",
    "summary": "AST SpaceMobile managed to defy stock market gravity this week.",
    "link": "https://www.fool.com/investing/2025/09/28/why-ast-spacemobile-stock-soared-this-week/?.tsrc=rss"
  },
  {
    "source": "Yahoo Finance",
    "title": "How does the credit market work? This strategist explains.",
    "summary": "Could a bubble be forming around equity markets (^DJI, ^IXIC, ^GSPC) as Big Tech pivots harder and harder into AI? To better understand what this could mean from the credit investing side of things, Asterozoa Capital CIO Joe Hegener sits down with Julie Hyman on the Morning Brief to talk more about the market environment for credit default swaps (CDS) and credit spreads. Also catch Joe Hegener illustrate whether investors are pouring \"gasoline on the fire\" as an AI-driven bubble could be forming around markets. To watch more expert insights and analysis on the latest market action, check out more Morning Brief.",
    "link": "https://finance.yahoo.com/video/does-credit-market-strategist-explains-100045406.html?.tsrc=rss"
  },
  {
    "source": "Yahoo Finance",
    "title": "Deutsche Bank: Bitcoin Could Join Gold on Central Bank Balance Sheets by 2030",
    "summary": "Bitcoin may soon join gold as a reserve asset on central bank balance sheets, according to analysts at Deutsche Bank, as momentum builds behind efforts to reshape the global financial system. Key Takeaways: Deutsche Bank says Bitcoin could sit alongside gold on central bank balance sheets by 2030. Trump’s strategic ...",
    "link": "https://cryptonews.com/news/deutsche-bank-bitcoin-could-join-gold-on-central-bank-balance-sheets-by-2030/?.tsrc=rss"
  },
  {
    "source": "Yahoo Finance",
    "title": "Are you ready for your first year of retirement? Here are 5 things you might not see coming",
    "summary": "The key to happiness in your golden years? Get off on the right foot",
    "link": "https://finance.yahoo.com/news/ready-first-retirement-5-things-091900185.html?.tsrc=rss"
  },
  {
    "source": "Yahoo Finance",
    "title": "10 Dividend Growers Whose Stocks Look Cheap",
    "summary": "A big reason is the outperformance of large-cap growth stocks, like the Magnificent 7, which tend to payout little or nothing in the way of dividends.  Fortunately, there are plenty of stocks with healthy, growing dividends that are also undervalued, according to a recent report from Morningstar.  The research firm ran a screen of stocks that raised their dividends over the past five years, pay out no more than 75% of earnings, and enjoy a solid competitive “moat” that should give them a consistent advantage over competitors.",
    "link": "https://finance.yahoo.com/m/0e3e088a-036e-31d9-80a2-617af4fc2300/10-dividend-growers-whose.html?.tsrc=rss"
  },
  {
    "source": "Yahoo Finance",
    "title": "Weekly Market Wrap: Apple up, Electronic Arts soars, and Intel resurfaces",
    "summary": "Here is what you need to know about the stock market this past week.",
    "link": "https://www.thestreet.com/investing/weekly-market-wrap-apple-up-electronic-arts-soars-and-intel-resurfaces?.tsrc=rss"
  },
  {
    "source": "Yahoo Finance",
    "title": "People keep pushing bitcoin on me, but it crashes regularly. What am I missing?",
    "summary": "How is owning crypto better portfolio management when U.S. stocks have come through every crisis?",
    "link": "https://www.marketwatch.com/story/people-have-predicted-dollar-doom-for-decades-what-makes-this-time-actually-different-c3521a9d?.tsrc=rss"
  },
  {
    "source": "Yahoo Finance",
    "title": "As Gold Keeps Setting New Highs, China Reportedly Wants to Be Its Custodian for Central Banks",
    "summary": "Beijing is said to be courting foreign central banks to store bullion in Shanghai vaults as gold hovers near record highs and demand strengthens.",
    "link": "https://www.coindesk.com/markets/2025/09/27/as-gold-keeps-setting-new-highs-china-reportedly-wants-to-be-its-custodian-for-central-banks?.tsrc=rss"
  },
  {
    "source": "CNBC News",
    "title": "President Trump posts cartoon image depicting him firing Fed Chief Powell",
    "summary": "Trump has repeatedly criticized Powell for his cautious approach to cutting interest rates, nicknaming him \"Too Late Powell.\"",
    "link": "https://www.cnbc.com/2025/09/27/trump-cartoon-firing-powell-fed.html"
  },
  {
    "source": "CNBC News",
    "title": "'Spectacular' AI growth is creating a serious labor market problem for Fed, Jefferies' David Zervos warns",
    "summary": "Long-time market bull David Zervos is worried the Federal Reserve is dangerously ignoring the artificial intelligence boom's fallout.",
    "link": "https://www.cnbc.com/2025/09/27/spectacular-ai-growth-to-spark-serious-jobs-issue-for-fed-zervos.html"
  },
  {
    "source": "CNBC News",
    "title": "Not just for the ultra-wealthy: Two firms team up to create more access to private credit boom",
    "summary": "Simplify Asset Management and VettaFi launched the actively managed Simplify VettaFi Private Credit Strategy ETF (PCR) on Wednesday.",
    "link": "https://www.cnbc.com/2025/09/27/private-credit-boom-behind-new-etf-designed-for-retail-investors.html"
  },
  {
    "source": "CNBC News",
    "title": "Stocks making the biggest moves midday: Boeing, Paccar, Intel, Mirion Tech and more",
    "summary": "These are some of the stocks posting the largest midday moves.",
    "link": "https://www.cnbc.com/2025/09/26/stocks-making-the-biggest-moves-midday-ba-mir-pcar.html"
  },
  {
    "source": "CNBC News",
    "title": "How does the U.S. stock market typically react to a government shutdown?",
    "summary": "The markets could be in for some action if the government shutdown next week, according to Bank of America.",
    "link": "https://www.cnbc.com/2025/09/26/market-reaction-past-government-shutdow.html"
  },
  {
    "source": "CNBC News",
    "title": "Chinese stocks are on fire this year, drawing big interest from foreign and domestic investors",
    "summary": "Chinese stocks, once deemed univestable by many, are luring both local and foreign investors impressed by recent returns.",
    "link": "https://www.cnbc.com/2025/09/26/chinese-stocks-are-on-fire-this-year-drawing-big-interest-from-foreign-and-domestic-investors.html"
  },
  {
    "source": "CNBC News",
    "title": "How gold, bitcoin are moving beyond market hedge and boosting investment income",
    "summary": "Investors want exposure to alternative assets that don't move with stocks and bonds. They also want income. Wall Street and BlackRock have an answer.",
    "link": "https://www.cnbc.com/2025/09/26/gold-bitcoin-market-hedge-income-yield-opportunities-blackrock-etf.html"
  },
  {
    "source": "CNBC News",
    "title": "Stocks making the biggest premarket moves: Paccar, Boeing, RH, Riot Platforms and more",
    "summary": "These are some of the stocks posting the largest moves in premarket trading Friday.",
    "link": "https://www.cnbc.com/2025/09/26/stocks-making-big-premarket-moves-paccar-intel-rh-riot-platforms-and-more.html"
  },
  {
    "source": "CNBC News",
    "title": "Once a $40 billion fintech darling, Checkout.com is now valued at $12 billion",
    "summary": "The internal valuation of $12 billion represents a significant decline from the $40 billion assigned to Checkout.com in a 2022 funding round.",
    "link": "https://www.cnbc.com/2025/09/26/fintech-checkoutcoms-valuation-falls-to-12-billion.html"
  },
  {
    "source": "CNBC News",
    "title": "Global casting call for top traders: From TV weatherman to dentist, FundSeeder finds hidden talent",
    "summary": "\"There are lots of great traders globally that are completely unknown,\" \"Market Wizards\" author Jack Schwager said.",
    "link": "https://www.cnbc.com/2025/09/25/global-casting-call-for-top-traders-from-tv-weatherman-to-dentist-fundseeder-finds-hidden-talent.html"
  },
  {
    "source": "CNBC News",
    "title": "Stocks making the biggest moves midday: Mirion Technologies, Freeport-McMoRan, CarMax & more",
    "summary": "These are the stocks posting the largest moves midday.",
    "link": "https://www.cnbc.com/2025/09/25/stocks-making-the-biggest-moves-midday-mir-fcx-kmx.html"
  },
  {
    "source": "CNBC News",
    "title": "Ken Griffin says more tariff impact on inflation is still ahead, Fed should be independent",
    "summary": "Ken Griffin said only about half of the inflationary impact from Trump's wide-spreading levies on U.S. trading partners has passed through the economy.",
    "link": "https://www.cnbc.com/2025/09/25/ken-griffin-say-more-tariff-impact-on-inflation-is-still-ahead-fed-should-be-independent.html"
  },
  {
    "source": "CNBC News",
    "title": "Disney investors say handling of Jimmy Kimmel suspension put politics over shareholders, demand records",
    "summary": "A group of Disney investors are seeking board materials, communications and policies related to the suspension of \"Jimmy Kimmel Live!\"",
    "link": "https://www.cnbc.com/2025/09/25/jimmy-kimmel-disney-investors-politics-fiduciary-duty.html"
  },
  {
    "source": "CNBC News",
    "title": "Stocks making the biggest premarket moves: Intel, Oracle, Lithium Americas, Opendoor and more",
    "summary": "These are the stocks posting the largest moves in the premarket.",
    "link": "https://www.cnbc.com/2025/09/25/stocks-making-the-biggest-premarket-moves-intc-orcl-lac-open.html"
  },
  {
    "source": "CNBC News",
    "title": "Early Revolut backer invests in AI-focused finance software startup Light",
    "summary": "Danish startup Light wants to disrupt the decades-old world of corporate accounting software.",
    "link": "https://www.cnbc.com/2025/09/25/ai-finance-startup-light-raises-funding-from-revolut-backer-balderton.html"
  },
  {
    "source": "CNBC News",
    "title": "Day trading is about to get easier for smaller retail investors",
    "summary": "Regulators are moving to dismantle one of the most controversial barriers for active retail traders — the $25,000 minimum equity rule for pattern day trading.",
    "link": "https://www.cnbc.com/2025/09/24/day-trading-is-about-to-get-easier-for-smaller-retail-investors.html"
  },
  {
    "source": "CNBC News",
    "title": "Stocks making the biggest moves midday: Alibaba, Lithium Americas, Freeport-McMoRan, UniQure and more",
    "summary": "These are the stocks posting the largest moves in midday trading.",
    "link": "https://www.cnbc.com/2025/09/24/stocks-making-the-biggest-moves-midday-baba-lac-qure-and-more.html"
  },
  {
    "source": "CNBC News",
    "title": "AI can now pass the hardest level of the CFA exam in a matter of minutes",
    "summary": "Previous research had found AI could clear Levels I and II of the CFA exam, but it struggled with Level III, due to the essay questions.",
    "link": "https://www.cnbc.com/2025/09/24/ai-cfa-exam-pass-minutes-study.html"
  },
  {
    "source": "CNBC News",
    "title": "Stocks making the biggest moves premarket: Alibaba, Micron, Lithium Americas, Oracle and more",
    "summary": "These are the stocks posting the largest moves in premarket trading.",
    "link": "https://www.cnbc.com/2025/09/24/stocks-making-the-biggest-moves-premarket-alibaba-millerknoll-oracle-and-more.html"
  },
  {
    "source": "CNBC News",
    "title": "Powell says slowing labor market prompted rate cut, sees 'challenging situation' ahead",
    "summary": "Powell said Tuesday that weakness in the labor market is outweighing concerns about stubborn inflation.",
    "link": "https://www.cnbc.com/2025/09/23/powell-says-slowing-labor-market-prompted-rate-cut-sees-challenging-situation-ahead.html"
  },
  {
    "source": "Financial Times World News",
    "title": "Reeves to tell business: wake up to danger that Reform UK poses",
    "summary": "Chancellor’s conference speech to form part of government’s onslaught on Nigel Farage’s ‘racist’ party",
    "link": "https://www.ft.com/content/8600718c-e06b-4e79-abb6-7397c9fbcd48"
  },
  {
    "source": "Financial Times World News",
    "title": "Starmer urges Labour to unite for ‘fight of our lives’ ahead of conference",
    "summary": "UK prime minister calls key Reform policy ‘racist’ as he focuses fire on Nigel Farage’s party",
    "link": "https://www.ft.com/content/a629dee0-a0fe-462e-b712-0c5019e7324a"
  },
  {
    "source": "Financial Times World News",
    "title": "UK government to guarantee jobs for young people on long-term benefits",
    "summary": "The chancellor will announce help for those who have been out of work or education for 18 months on Monday",
    "link": "https://www.ft.com/content/aed9feef-b0c5-40c6-8515-1b6fc7ace635"
  },
  {
    "source": "Financial Times World News",
    "title": "Democracy activist Nathan Law denied entry to Singapore",
    "summary": "Hong Kong has issued a bounty for arrest of former student leader of the Umbrella Movement protest group",
    "link": "https://www.ft.com/content/45f05168-5447-4b31-833a-61761e4560a5"
  },
  {
    "source": "Financial Times World News",
    "title": "Spain has become Europe’s standout economy",
    "summary": "But it must combine immigration-led growth with productivity improvements",
    "link": "https://www.ft.com/content/643a6a5d-f5af-464c-86c3-0fe5396d707e"
  },
  {
    "source": "Financial Times World News",
    "title": "Why CEOs are right to stick close to Trump",
    "summary": "The history of antitrust policy in America shows that executives ignore Washington at their peril",
    "link": "https://www.ft.com/content/84f20ed4-cb0a-4b90-b0e1-e714a29b3d16"
  },
  {
    "source": "Financial Times World News",
    "title": "‘Moral hazard’ warning after £1.5bn government loan guarantee for JLR",
    "summary": "Carmaker receives official backing after cyber attack that has halted production",
    "link": "https://www.ft.com/content/27e5eedd-6780-4d61-ab24-4be240792a20"
  },
  {
    "source": "Financial Times World News",
    "title": "New York mayor Eric Adams abandons re-election bid",
    "summary": "Democratic socialist Zohran Mamdani and Andrew Cuomo will now face off in city’s November poll",
    "link": "https://www.ft.com/content/50bd0194-3ef0-4525-9468-d264619bf7bd"
  },
  {
    "source": "Financial Times World News",
    "title": "European defence tech investor gets boost as geopolitical tensions persist",
    "summary": "Expeditions says second fund on track to close at €150mn by end of year, compared with €15mn for the first one",
    "link": "https://www.ft.com/content/34900327-5af5-4e9c-8520-fcc8a7ed0db9"
  },
  {
    "source": "Financial Times World News",
    "title": "Pro-EU party leads in Moldova’s parliamentary election",
    "summary": "Overseas votes may boost Maia Sandu’s ruling party after officials accused Russia of underhand tactics before poll",
    "link": "https://www.ft.com/content/cde1886e-36ed-465e-8c49-ec69994c450c"
  },
  {
    "source": "Google News - Stock Market",
    "title": "'Buffett Indicator' for stock valuation passes 200%, beyond level he once said is 'playing with fire' - CNBC",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMihAFBVV95cUxPOXg0UmFLQzdHTjliaDJjZW9GQVZxQTNES1NaVmQ1Z2NPZXFPemt3MVdFXzhLWWZXZVh4YmhKU1Nqam5OaHhzYWRDVGZYNno1T1plSlkyeWJFcTlPbHFhSmVoZ0FuXzVWcUh6QTR4R0I5RDRZVW9fdE1WVWdiQkdBSldXbTA?oc=5\" target=\"_blank\">'Buffett Indicator' for stock valuation passes 200%, beyond level he once said is 'playing with fire'</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CNBC</font>",
    "link": "https://news.google.com/rss/articles/CBMihAFBVV95cUxPOXg0UmFLQzdHTjliaDJjZW9GQVZxQTNES1NaVmQ1Z2NPZXFPemt3MVdFXzhLWWZXZVh4YmhKU1Nqam5OaHhzYWRDVGZYNno1T1plSlkyeWJFcTlPbHFhSmVoZ0FuXzVWcUh6QTR4R0I5RDRZVW9fdE1WVWdiQkdBSldXbTA?oc=5"
  },
  {
    "source": "Google News - Stock Market",
    "title": "Americans have more money in stocks than ever before. Economists say that’s a bright red flag - CNN",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMiigFBVV95cUxNZlNBUk1oemFrS0dUekNudl9hYktNYjhmVzhfR0ZhaDBwTTJ1QUh6QkpBM0l0bDcxbmhiUTdzdzBpcDJxT2JySm9rSUxKXzAtaXBFVkpGYWFLM2dwa3Vodml5dHU0bDlzX0U0ZTktNkdSWThIOTk0UVltWEt6M2paeXRIN1BoLVJRaGc?oc=5\" target=\"_blank\">Americans have more money in stocks than ever before. Economists say that’s a bright red flag</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CNN</font>",
    "link": "https://news.google.com/rss/articles/CBMiigFBVV95cUxNZlNBUk1oemFrS0dUekNudl9hYktNYjhmVzhfR0ZhaDBwTTJ1QUh6QkpBM0l0bDcxbmhiUTdzdzBpcDJxT2JySm9rSUxKXzAtaXBFVkpGYWFLM2dwa3Vodml5dHU0bDlzX0U0ZTktNkdSWThIOTk0UVltWEt6M2paeXRIN1BoLVJRaGc?oc=5"
  },
  {
    "source": "Google News - Stock Market",
    "title": "CNBC Daily Open: Breaking the September market curse - CNBC",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMikwFBVV95cUxNSUpVLS1wSm95M2VGdDNoVkFEaXc4a3o2V09PYS1vdS1EdFRhb21Qd3Rnb3d4NU5tZjIxY0xCWUdJQ1MtT01pa1Ita25heEFvSEVSVndmNmZmbXo4WUpZSUppS05uTDdON1BlWTVxeXoxOF9VRWhqcmlNYmZISGUtYmd1SVZPZ2dHMFI2U242U0VBT0HSAZgBQVVfeXFMTWVhbVBBb1FNbHlwczVfVVFFNGpubk5PM3dQMUItVGNuSlVQMHR1TzJaOUpHSVhsZ2dyZi1FNzMzbW5HNkZ3ZEVFWmpFbWlLMDVxMEdIdnJGMVpJVFFFOVp3NldDbjBrQnRvRkJrcjhCRDFCbXEtYXV3MkV4US1zWUJadEJnU0tMaFNhUnZLVE55LVZXZXpTRDc?oc=5\" target=\"_blank\">CNBC Daily Open: Breaking the September market curse</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CNBC</font>",
    "link": "https://news.google.com/rss/articles/CBMikwFBVV95cUxNSUpVLS1wSm95M2VGdDNoVkFEaXc4a3o2V09PYS1vdS1EdFRhb21Qd3Rnb3d4NU5tZjIxY0xCWUdJQ1MtT01pa1Ita25heEFvSEVSVndmNmZmbXo4WUpZSUppS05uTDdON1BlWTVxeXoxOF9VRWhqcmlNYmZISGUtYmd1SVZPZ2dHMFI2U242U0VBT0HSAZgBQVVfeXFMTWVhbVBBb1FNbHlwczVfVVFFNGpubk5PM3dQMUItVGNuSlVQMHR1TzJaOUpHSVhsZ2dyZi1FNzMzbW5HNkZ3ZEVFWmpFbWlLMDVxMEdIdnJGMVpJVFFFOVp3NldDbjBrQnRvRkJrcjhCRDFCbXEtYXV3MkV4US1zWUJadEJnU0tMaFNhUnZLVE55LVZXZXpTRDc?oc=5"
  },
  {
    "source": "Google News - Stock Market",
    "title": "Stock market today: Dow, S&P 500, Nasdaq futures edge up with government shutdown in focus - Yahoo Finance",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMi0wFBVV95cUxOdXJpVlhRWEFIWmJpUHV4SUhrWmRGems5LVRSa2t5SXUtRmdVdDVHR2tJTEVoS25SSEgwSWlZTnhpZDQ1eFJCUU9WajNsWmJLbUNRZDJIZlNzLUFrckE4YkdtbkxpRWF0OTlVT2tmY1pycjF3a196U1oybTZoN1M5WUlvQm1YdTFnMmpxTkxQM20zOExVbTNpdlAwYl9wWnItRXd1Z21sRjhlMy1HZVRyS0F0Umg1YmVuVUN3cUc2dWxUZTBaVGJ2NHdlb2MzN0tpbzJV?oc=5\" target=\"_blank\">Stock market today: Dow, S&amp;P 500, Nasdaq futures edge up with government shutdown in focus</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Yahoo Finance</font>",
    "link": "https://news.google.com/rss/articles/CBMi0wFBVV95cUxOdXJpVlhRWEFIWmJpUHV4SUhrWmRGems5LVRSa2t5SXUtRmdVdDVHR2tJTEVoS25SSEgwSWlZTnhpZDQ1eFJCUU9WajNsWmJLbUNRZDJIZlNzLUFrckE4YkdtbkxpRWF0OTlVT2tmY1pycjF3a196U1oybTZoN1M5WUlvQm1YdTFnMmpxTkxQM20zOExVbTNpdlAwYl9wWnItRXd1Z21sRjhlMy1HZVRyS0F0Umg1YmVuVUN3cUc2dWxUZTBaVGJ2NHdlb2MzN0tpbzJV?oc=5"
  },
  {
    "source": "Google News - Stock Market",
    "title": "U.S. stock futures little changed as investors eye possible government shutdown - MarketWatch",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMivgFBVV95cUxNNmZFMnFqbkVxU2ZhaFBnS3haU1BIbDZLMlFJb19Tam9OV2pwdGNRbG5GSGVKcG8wSHpRU19xa2ZqYUpJeVdZVkV3cTRlY0ZkWjRvblFLYk96cDNHZkZLYmhoeGpzVUIyUTNnV1lycGpJZmxCX3Z1NjBROHlLNEEyNGJyTzB4ZDJfZ3BpcG9xWWgtWmpkdGJzQUlSa1FUN3YxdWhsTHRJYzhVd1k2enhuaWtKZ1RyV0ViNTA3YXpB?oc=5\" target=\"_blank\">U.S. stock futures little changed as investors eye possible government shutdown</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">MarketWatch</font>",
    "link": "https://news.google.com/rss/articles/CBMivgFBVV95cUxNNmZFMnFqbkVxU2ZhaFBnS3haU1BIbDZLMlFJb19Tam9OV2pwdGNRbG5GSGVKcG8wSHpRU19xa2ZqYUpJeVdZVkV3cTRlY0ZkWjRvblFLYk96cDNHZkZLYmhoeGpzVUIyUTNnV1lycGpJZmxCX3Z1NjBROHlLNEEyNGJyTzB4ZDJfZ3BpcG9xWWgtWmpkdGJzQUlSa1FUN3YxdWhsTHRJYzhVd1k2enhuaWtKZ1RyV0ViNTA3YXpB?oc=5"
  },
  {
    "source": "Google News - Stock Market",
    "title": "US stock futures edge higher; govt. shutdown in focus - Investing.com",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMirAFBVV95cUxNWTRvSGZ1alB2RlFxS0c4MURLZlJCSmMwTk9sLVJUVDVQZ2RnR1NwazNxYnM0ZnNGQjAwal9oa0pmNnl6NWNSUVlCckNyalFpdkxMdE9FN1VmM3cyM09jeGIyOEdhX3UycnFyS2FXN1NSTzdBN2FUajZzejUwenQ5eWpCWFJvMzMxcGtjb1RiU3BrRDRkU0VBNktXT0J1NVVSNU91eTkzZDF4MTh5?oc=5\" target=\"_blank\">US stock futures edge higher; govt. shutdown in focus</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Investing.com</font>",
    "link": "https://news.google.com/rss/articles/CBMirAFBVV95cUxNWTRvSGZ1alB2RlFxS0c4MURLZlJCSmMwTk9sLVJUVDVQZ2RnR1NwazNxYnM0ZnNGQjAwal9oa0pmNnl6NWNSUVlCckNyalFpdkxMdE9FN1VmM3cyM09jeGIyOEdhX3UycnFyS2FXN1NSTzdBN2FUajZzejUwenQ5eWpCWFJvMzMxcGtjb1RiU3BrRDRkU0VBNktXT0J1NVVSNU91eTkzZDF4MTh5?oc=5"
  },
  {
    "source": "Google News - Stock Market",
    "title": "The stock market valuation chart we want now but can't have until 2035 🔮 - TKer by Sam Ro",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMia0FVX3lxTFBjVS1iRkMteWpiMC1ObVB0YWNyNWJfSW9VOXhCTGdNWWlvNFE3eUtta2JtOGVkWDB6d1JSNHlJdnI5YUFFa3FjWDV4dXA4OUxYRnNjWWM4Y0JmcmIwYTNwdWJydW5sSkJMSWpz?oc=5\" target=\"_blank\">The stock market valuation chart we want now but can't have until 2035 🔮</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">TKer by Sam Ro</font>",
    "link": "https://news.google.com/rss/articles/CBMia0FVX3lxTFBjVS1iRkMteWpiMC1ObVB0YWNyNWJfSW9VOXhCTGdNWWlvNFE3eUtta2JtOGVkWDB6d1JSNHlJdnI5YUFFa3FjWDV4dXA4OUxYRnNjWWM4Y0JmcmIwYTNwdWJydW5sSkJMSWpz?oc=5"
  },
  {
    "source": "Google News - Stock Market",
    "title": "Sister Demands Brother Give Her Part of His Stock Market Earnings - People.com",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMimAFBVV95cUxPMkVzV1RES1BYd2U0U0YwZnRETHhBNm0zWVYtVXNJcERmWm56cWtZSF9OVnZpWk1Tbk4zMXRJUWFHbENqYy1jc2hCQUtQWkVwUDZrbXktTWUyOTYyczlCQ1R5RWVTWHNtMlg1bGp0cEkwUkF5NGZLeWNUbEprZlkyeTNFektXR2lQUm0yVjJfZVBxVG1NVGdpVg?oc=5\" target=\"_blank\">Sister Demands Brother Give Her Part of His Stock Market Earnings</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">People.com</font>",
    "link": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPMkVzV1RES1BYd2U0U0YwZnRETHhBNm0zWVYtVXNJcERmWm56cWtZSF9OVnZpWk1Tbk4zMXRJUWFHbENqYy1jc2hCQUtQWkVwUDZrbXktTWUyOTYyczlCQ1R5RWVTWHNtMlg1bGp0cEkwUkF5NGZLeWNUbEprZlkyeTNFektXR2lQUm0yVjJfZVBxVG1NVGdpVg?oc=5"
  },
  {
    "source": "Google News - Stock Market",
    "title": "Stock Market News Sept. 26, 2025: Dow Rises After Trump Unveils New Tariffs - The Wall Street Journal",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMijANBVV95cUxNRzIwUFNybk1UWktSVlE0Rjk3c1J6dzFUYWpkREk2VjNVLUZSRFB0N290cWNsWTFGODFaN05Ya1FFS3RrTkVPUGtPLW1HeldXWmhUWVVlNlQzLUZCbUVTOW9STGtQaXN4T0hFOTRrNXdaeDdYVnpZVkZxU2lxYXBZb25mUVhadHM1VXQ0SnQ3V0tyOFJ0RWZla3lnSFo2eFJRZkhvdVN1OW90QjdDNEpWYmF3dmZZT2pZR3hYM1pxd2lobDQtV0dDV2JSaTlaeE55X3ZXUTVidUN2TUV4QWE0cHptVktYOFN2c2VjalZwQkN6bUdSbWNhR1hhUGdsREtVVzlwNXdoQTJJUmRJbDM0OWtIcXNQc19tR0xFb3FOUlpmdHVVWlNvS0ZLMmZISzdzaDdjLWRnVUtRcDh4TkZjU1F3UGx6R0VzZzlCQmFxZXA5UDBCYnhBa0JpbnRwc2FlZEtodlhac1RvTi1mcFNzWENsVFJ1LXJIZWl0VzRiWExoT0RTVEdPdGRzQVI?oc=5\" target=\"_blank\">Stock Market News Sept. 26, 2025: Dow Rises After Trump Unveils New Tariffs</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Wall Street Journal</font>",
    "link": "https://news.google.com/rss/articles/CBMijANBVV95cUxNRzIwUFNybk1UWktSVlE0Rjk3c1J6dzFUYWpkREk2VjNVLUZSRFB0N290cWNsWTFGODFaN05Ya1FFS3RrTkVPUGtPLW1HeldXWmhUWVVlNlQzLUZCbUVTOW9STGtQaXN4T0hFOTRrNXdaeDdYVnpZVkZxU2lxYXBZb25mUVhadHM1VXQ0SnQ3V0tyOFJ0RWZla3lnSFo2eFJRZkhvdVN1OW90QjdDNEpWYmF3dmZZT2pZR3hYM1pxd2lobDQtV0dDV2JSaTlaeE55X3ZXUTVidUN2TUV4QWE0cHptVktYOFN2c2VjalZwQkN6bUdSbWNhR1hhUGdsREtVVzlwNXdoQTJJUmRJbDM0OWtIcXNQc19tR0xFb3FOUlpmdHVVWlNvS0ZLMmZISzdzaDdjLWRnVUtRcDh4TkZjU1F3UGx6R0VzZzlCQmFxZXA5UDBCYnhBa0JpbnRwc2FlZEtodlhac1RvTi1mcFNzWENsVFJ1LXJIZWl0VzRiWExoT0RTVEdPdGRzQVI?oc=5"
  },
  {
    "source": "Google News - Stock Market",
    "title": "Wall St Week Ahead: Investors look to jobs data to support rate-cut path, pricey stock market - Reuters",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMiwAFBVV95cUxOZWlZSS1BaXU1UFdoY1FfOG1pdVFjSi00UFJUdWk3Y2w2TjVUVGllWlB2SUxfWGRvY3I1VUVMZEhzdWplYUZYUHZWSnlLQloxSWsyeDQtSVotdldUOWZlb3g3YndHZjBLcFZ5djhfQWJoNVNDZXdBUkgwNWR0eDJWVTRlYkk0TEMtcllzZi1WT2dBblJKYk9VQWVwUS1mTUZxeVVOTXBveWs2NkVvUG8yRWlTU1ZwU2E0TnlEUURIS1E?oc=5\" target=\"_blank\">Wall St Week Ahead: Investors look to jobs data to support rate-cut path, pricey stock market</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Reuters</font>",
    "link": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxOZWlZSS1BaXU1UFdoY1FfOG1pdVFjSi00UFJUdWk3Y2w2TjVUVGllWlB2SUxfWGRvY3I1VUVMZEhzdWplYUZYUHZWSnlLQloxSWsyeDQtSVotdldUOWZlb3g3YndHZjBLcFZ5djhfQWJoNVNDZXdBUkgwNWR0eDJWVTRlYkk0TEMtcllzZi1WT2dBblJKYk9VQWVwUS1mTUZxeVVOTXBveWs2NkVvUG8yRWlTU1ZwU2E0TnlEUURIS1E?oc=5"
  },
  {
    "source": "Google News - Stock Market",
    "title": "Trump Administration Raises Shutdown Stakes. What It Means for the Stock Market. - Barron's",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMihgFBVV95cUxPUk5rTFozWlprT3l1bFVzYWVYRW1xNHhtVG1JREZtakRYUDV1b2U2Nlp0NmlDWmw5d3J1dnF4enhpeGZlWVk4LUdNYldGYVhwOWdLWEMxVHNJUGxubTNDQ0ZZMWlFOTYxSHhwR3FKanFuNm5ieUZFSU9lbXVqd19lX3l1YmhOdw?oc=5\" target=\"_blank\">Trump Administration Raises Shutdown Stakes. What It Means for the Stock Market.</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Barron's</font>",
    "link": "https://news.google.com/rss/articles/CBMihgFBVV95cUxPUk5rTFozWlprT3l1bFVzYWVYRW1xNHhtVG1JREZtakRYUDV1b2U2Nlp0NmlDWmw5d3J1dnF4enhpeGZlWVk4LUdNYldGYVhwOWdLWEMxVHNJUGxubTNDQ0ZZMWlFOTYxSHhwR3FKanFuNm5ieUZFSU9lbXVqd19lX3l1YmhOdw?oc=5"
  },
  {
    "source": "Google News - Stock Market",
    "title": "Stock Market Today: Indexes Break Losing Streaks. Why The Surge In Electronic Arts Shares? - Investor's Business Daily",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMiwAFBVV95cUxNeEVrLXNWcjZMUXc2X0dGTVYzR1pIaFVjcHZZQXN6X3h1ZERkMFpqV3hlZHp0c3JrQXdJR0tJLUhOd25VNERSM3htZm0xOG9DZS14bVBfTlA4VnFGZ3RjdnEtX1FFTmc3QXc3YXhtbVVFeDJrelRXNjQ1WmtvTlFkSEhUV2FEaXVidGkzUnhKejJla1hGQlJOQ1hJdXFHY2x3cV9fbmVQZl9VZDU4X0Z2RGFhVlkwM3ZqZGFsR2c2Tlc?oc=5\" target=\"_blank\">Stock Market Today: Indexes Break Losing Streaks. Why The Surge In Electronic Arts Shares?</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Investor's Business Daily</font>",
    "link": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxNeEVrLXNWcjZMUXc2X0dGTVYzR1pIaFVjcHZZQXN6X3h1ZERkMFpqV3hlZHp0c3JrQXdJR0tJLUhOd25VNERSM3htZm0xOG9DZS14bVBfTlA4VnFGZ3RjdnEtX1FFTmc3QXc3YXhtbVVFeDJrelRXNjQ1WmtvTlFkSEhUV2FEaXVidGkzUnhKejJla1hGQlJOQ1hJdXFHY2x3cV9fbmVQZl9VZDU4X0Z2RGFhVlkwM3ZqZGFsR2c2Tlc?oc=5"
  },
  {
    "source": "Google News - Stock Market",
    "title": "Stock futures are flat in overnight trading following a losing week: Live updates - CNBC",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMid0FVX3lxTE1oVUMxWUpzSTBUWHFCRHlJcEhFSlJiMXRmQWZkZUNPbWk4U3ZRYUk4a3NNbHB5VTJsMjNaek05N3RfdjhzeF9hR0NKV3RXbl95Sk1WRndfUzFWc2xCQjVEU1dleU1PWGJUMmhQTkQ5cTNMTWlSY0lF?oc=5\" target=\"_blank\">Stock futures are flat in overnight trading following a losing week: Live updates</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CNBC</font>",
    "link": "https://news.google.com/rss/articles/CBMid0FVX3lxTE1oVUMxWUpzSTBUWHFCRHlJcEhFSlJiMXRmQWZkZUNPbWk4U3ZRYUk4a3NNbHB5VTJsMjNaek05N3RfdjhzeF9hR0NKV3RXbl95Sk1WRndfUzFWc2xCQjVEU1dleU1PWGJUMmhQTkQ5cTNMTWlSY0lF?oc=5"
  },
  {
    "source": "Google News - Stock Market",
    "title": "The New York Stock Exchange | NYSE - The New York Stock Exchange",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMiP0FVX3lxTE93UWVlU3g1TVNpdTNEcjI2Yk9kSHU2Tnh5Y0stVFBGRWVkLW9wbU1EbHhQaHdIOE56d2V5NXVhSQ?oc=5\" target=\"_blank\">The New York Stock Exchange | NYSE</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The New York Stock Exchange</font>",
    "link": "https://news.google.com/rss/articles/CBMiP0FVX3lxTE93UWVlU3g1TVNpdTNEcjI2Yk9kSHU2Tnh5Y0stVFBGRWVkLW9wbU1EbHhQaHdIOE56d2V5NXVhSQ?oc=5"
  },
  {
    "source": "Google News - Stock Market",
    "title": "Futures Rise With Tesla, Jobs Ahead; Five Stocks To Watch - Investor's Business Daily",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMixAFBVV95cUxNZEVVbTlPNXQzNHZlTk54UHE2UkZibXFCQ0ZhRFBOTUVidU1NM1VrOEFzQy1aWFRHa1dzaDgyOVZNOEkxbjQ5OWtWelcyNTAzUjlMTFB6aHh6aU02QURVYmloVERGMV8yOUxWTENCZDkwcUhndzhDdVoyRGF4QUl0MHFOSVA5Tl9COGN5NE9KUXQ3N25kcHhpYzBpazQ3X3hWYWpPU1NvWjFnZG9WYmNUVmR5eklnOGZCa3pzR1htZUhvVmxa?oc=5\" target=\"_blank\">Futures Rise With Tesla, Jobs Ahead; Five Stocks To Watch</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Investor's Business Daily</font>",
    "link": "https://news.google.com/rss/articles/CBMixAFBVV95cUxNZEVVbTlPNXQzNHZlTk54UHE2UkZibXFCQ0ZhRFBOTUVidU1NM1VrOEFzQy1aWFRHa1dzaDgyOVZNOEkxbjQ5OWtWelcyNTAzUjlMTFB6aHh6aU02QURVYmloVERGMV8yOUxWTENCZDkwcUhndzhDdVoyRGF4QUl0MHFOSVA5Tl9COGN5NE9KUXQ3N25kcHhpYzBpazQ3X3hWYWpPU1NvWjFnZG9WYmNUVmR5eklnOGZCa3pzR1htZUhvVmxa?oc=5"
  },
  {
    "source": "Google News - Stock Market",
    "title": "Oil Drops as OPEC+ Seen Increasing Output Again: Markets Wrap - Bloomberg.com",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMirwFBVV95cUxPelBoMTRwc0RfY2VBQ1RxOVFyZVJuZHNzbW9UY0QwUEIyNHdBTmVuNGk5bHo2aVRmRENzMWZvb1I2Rm9NeWhWaWVacFZqa1hFRnRBZnZTTmhKSlFJa2RYejU2VGNGamdUeGFzajg1VWlkT3VMNld6Z0RpcndldkdHdlliTjd4TkNXZHRraEhHblZDMWE3QXUtWUFVblNqWnFFSk1aTnIyNm1pWDBKaGJv?oc=5\" target=\"_blank\">Oil Drops as OPEC+ Seen Increasing Output Again: Markets Wrap</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Bloomberg.com</font>",
    "link": "https://news.google.com/rss/articles/CBMirwFBVV95cUxPelBoMTRwc0RfY2VBQ1RxOVFyZVJuZHNzbW9UY0QwUEIyNHdBTmVuNGk5bHo2aVRmRENzMWZvb1I2Rm9NeWhWaWVacFZqa1hFRnRBZnZTTmhKSlFJa2RYejU2VGNGamdUeGFzajg1VWlkT3VMNld6Z0RpcndldkdHdlliTjd4TkNXZHRraEhHblZDMWE3QXUtWUFVblNqWnFFSk1aTnIyNm1pWDBKaGJv?oc=5"
  },
  {
    "source": "Google News - Stock Market",
    "title": "5 Things to Know Before the Stock Market Opens - Investopedia",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMipAFBVV95cUxPZmJRLUpCYW41ZExRUHdnbDNmYlZFRHZ3OGRTbXd6TlVrWE41ZjBCb1IzbjRzOG16YjQ1dURfLUVJenpWSnd3LXV6WFZEMEh2TFlySlozMVFVbUkwN1NXYnBKQTkzX0hWMFoxZy0zTDRaRTBaUDFXa19uRGhXMWVVNzhyMzdQTlhiZm90cWI4RjdTM2Jnc3I1Qmk0YjJmMU5OaE9WVg?oc=5\" target=\"_blank\">5 Things to Know Before the Stock Market Opens</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Investopedia</font>",
    "link": "https://news.google.com/rss/articles/CBMipAFBVV95cUxPZmJRLUpCYW41ZExRUHdnbDNmYlZFRHZ3OGRTbXd6TlVrWE41ZjBCb1IzbjRzOG16YjQ1dURfLUVJenpWSnd3LXV6WFZEMEh2TFlySlozMVFVbUkwN1NXYnBKQTkzX0hWMFoxZy0zTDRaRTBaUDFXa19uRGhXMWVVNzhyMzdQTlhiZm90cWI4RjdTM2Jnc3I1Qmk0YjJmMU5OaE9WVg?oc=5"
  },
  {
    "source": "Google News - Stock Market",
    "title": "Stock Market This Week Forecast - S&P 500 at 6,643 and Nasdaq at 22,484 Face Critical Jobs Data and Tesla’s 456K Delivery Test & Nike Stock On The Watch - TradingNEWS",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMioAFBVV95cUxNcEl4cjZZSUVETm5mTjVaTXFqMGV3U1k0ZU42dWR5RFR2cG1CV2NJNEZVb1FlMmQ1dTNqOEpYdTQ4Z1Y5TmpSbFZPdDdzaDd0RVFBZ1kzeXNaekhLWDlieGVUVmwteXRjbUlsdzVCNGc1VGY3Z2J3cHE3dmVPdmFnazFpZG1fY3l1YTVvaVZFU1R5cEwzSHluYVhQdndidmtq?oc=5\" target=\"_blank\">Stock Market This Week Forecast - S&amp;P 500 at 6,643 and Nasdaq at 22,484 Face Critical Jobs Data and Tesla’s 456K Delivery Test & Nike Stock On The Watch</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">TradingNEWS</font>",
    "link": "https://news.google.com/rss/articles/CBMioAFBVV95cUxNcEl4cjZZSUVETm5mTjVaTXFqMGV3U1k0ZU42dWR5RFR2cG1CV2NJNEZVb1FlMmQ1dTNqOEpYdTQ4Z1Y5TmpSbFZPdDdzaDd0RVFBZ1kzeXNaekhLWDlieGVUVmwteXRjbUlsdzVCNGc1VGY3Z2J3cHE3dmVPdmFnazFpZG1fY3l1YTVvaVZFU1R5cEwzSHluYVhQdndidmtq?oc=5"
  },
  {
    "source": "Google News - Stock Market",
    "title": "Federal court rejects appeal for Monroe man convicted in stock market investment scheme - WCNC",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMixgFBVV95cUxQQVBYei1NZEZmWDZWWTVJR1FlWlYyQ1NNS1JDa2QtZnUzZktEc2tVN2pVQUprLTRrTE0zX0pHaS1ERDZSejg1NFlfUEpqakNlTkdkS2JyUzNwdWdVTThWaVlEbnpibU5obmw1VEVYNjJwWDZ2NnBUYS12ZGhuODdzYmdqeDNDWWpyblg3QUdna0NSNUdsWVFIX1JJMlc3d21qNTlHSE1sRklMVGNfS2xEZFBDUWxMQTlWdGt3Ylg1WUJvVlBrV3c?oc=5\" target=\"_blank\">Federal court rejects appeal for Monroe man convicted in stock market investment scheme</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">WCNC</font>",
    "link": "https://news.google.com/rss/articles/CBMixgFBVV95cUxQQVBYei1NZEZmWDZWWTVJR1FlWlYyQ1NNS1JDa2QtZnUzZktEc2tVN2pVQUprLTRrTE0zX0pHaS1ERDZSejg1NFlfUEpqakNlTkdkS2JyUzNwdWdVTThWaVlEbnpibU5obmw1VEVYNjJwWDZ2NnBUYS12ZGhuODdzYmdqeDNDWWpyblg3QUdna0NSNUdsWVFIX1JJMlc3d21qNTlHSE1sRklMVGNfS2xEZFBDUWxMQTlWdGt3Ylg1WUJvVlBrV3c?oc=5"
  },
  {
    "source": "Google News - Stock Market",
    "title": "Here are the 2 big things we're watching in the stock market in the week ahead - CNBC",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMitAFBVV95cUxNbk5MYWtTdVJaU19reDV5bHNMMXJvRkRqQU50b3VmbWJzQ1EzY04tLUt3MzAtT3c5TllWZWRpUEVqbkxLaFlCNEw0M2ZubVBCNTRwMWFVcHp4dHpNejM1UURxd2E1ZXdWaTJwODdwU3JMSmRmYXJHaHZraWUtSlhvZVI4bXdzS25QakhxWmdra09xVWhuQlJNeVdmWHg2VWRhLWZNTmppQTNfYkpVdTF4a1hJejE?oc=5\" target=\"_blank\">Here are the 2 big things we're watching in the stock market in the week ahead</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CNBC</font>",
    "link": "https://news.google.com/rss/articles/CBMitAFBVV95cUxNbk5MYWtTdVJaU19reDV5bHNMMXJvRkRqQU50b3VmbWJzQ1EzY04tLUt3MzAtT3c5TllWZWRpUEVqbkxLaFlCNEw0M2ZubVBCNTRwMWFVcHp4dHpNejM1UURxd2E1ZXdWaTJwODdwU3JMSmRmYXJHaHZraWUtSlhvZVI4bXdzS25QakhxWmdra09xVWhuQlJNeVdmWHg2VWRhLWZNTmppQTNfYkpVdTF4a1hJejE?oc=5"
  }
]